RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
/* SPDX-License-Identifier: BSD-3-Clause */

/**
 * @file
 *
 * @ingroup RTEMSBSPsARMimxrt
 *
 * @brief Pin function definitions for i.MXRT1166.
 *
 * Note: This file is basically a reformatted version of the fsl_iomuxc.h. RTEMS
 * uses a driver based on the FreeBSD iomux driver for the i.mx6. That driver
 * expects a different order of the values.
 */

/*
 * Copyright 2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * Copyright (C) 2023 embedded brains GmbH & Co. KG
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef LIBBSP_ARM_IMXRT_IMXRT1166_PINFUNC_H
#define LIBBSP_ARM_IMXRT_IMXRT1166_PINFUNC_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/*
 * Order of registers:
 * muxRegister, configRegister, inputRegister, muxMode, inputDaisy
 */

/* LPSR pins. Base address is 0x40c08000 */

#define IMXRT_PAD_GPIO_LPSR_00_FLEXCAN3_TX           0x40c08000 0x40c08040 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_00_MIC_CLK               0x40c08000 0x40c08040 0          0x1 0
#define IMXRT_PAD_GPIO_LPSR_00_MQS_RIGHT             0x40c08000 0x40c08040 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_00_ARM_CM4_EVENTO        0x40c08000 0x40c08040 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_00_GPIO_MUX6_IO00        0x40c08000 0x40c08040 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_00_LPUART12_TXD          0x40c08000 0x40c08040 0x40c080B0 0x6 0
#define IMXRT_PAD_GPIO_LPSR_00_SAI4_MCLK             0x40c08000 0x40c08040 0x40c080C8 0x7 0
#define IMXRT_PAD_GPIO_LPSR_00_GPIO12_IO00           0x40c08000 0x40c08040 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_01_FLEXCAN3_RX           0x40c08004 0x40c08044 0x40c08080 0x0 0
#define IMXRT_PAD_GPIO_LPSR_01_MIC_BITSTREAM0        0x40c08004 0x40c08044 0x40c080B4 0x1 0
#define IMXRT_PAD_GPIO_LPSR_01_MQS_LEFT              0x40c08004 0x40c08044 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_01_ARM_CM4_EVENTI        0x40c08004 0x40c08044 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_01_GPIO_MUX6_IO01        0x40c08004 0x40c08044 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_01_LPUART12_RXD          0x40c08004 0x40c08044 0x40c080AC 0x6 0
#define IMXRT_PAD_GPIO_LPSR_01_GPIO12_IO01           0x40c08004 0x40c08044 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_02_GPIO12_IO02           0x40c08008 0x40c08048 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_02_SRC_BOOT_MODE00       0x40c08008 0x40c08048 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_02_LPSPI5_SCK            0x40c08008 0x40c08048 0x40c08098 0x1 0
#define IMXRT_PAD_GPIO_LPSR_02_SAI4_TX_DATA          0x40c08008 0x40c08048 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_02_MQS_RIGHT             0x40c08008 0x40c08048 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_02_GPIO_MUX6_IO02        0x40c08008 0x40c08048 0          0x5 0

#define IMXRT_PAD_GPIO_LPSR_03_SRC_BOOT_MODE01       0x40c0800C 0x40c0804C 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_03_LPSPI5_PCS0           0x40c0800C 0x40c0804C 0x40c08094 0x1 0
#define IMXRT_PAD_GPIO_LPSR_03_SAI4_TX_SYNC          0x40c0800C 0x40c0804C 0x40c080DC 0x2 0
#define IMXRT_PAD_GPIO_LPSR_03_MQS_LEFT              0x40c0800C 0x40c0804C 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_03_GPIO_MUX6_IO03        0x40c0800C 0x40c0804C 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_03_GPIO12_IO03           0x40c0800C 0x40c0804C 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_04_LPI2C5_SDA            0x40c08010 0x40c08050 0x40c08088 0x0 0
#define IMXRT_PAD_GPIO_LPSR_04_LPSPI5_SOUT           0x40c08010 0x40c08050 0x40c080A0 0x1 0
#define IMXRT_PAD_GPIO_LPSR_04_SAI4_TX_BCLK          0x40c08010 0x40c08050 0x40c080D8 0x2 0
#define IMXRT_PAD_GPIO_LPSR_04_LPUART12_RTS_B        0x40c08010 0x40c08050 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_04_GPIO_MUX6_IO04        0x40c08010 0x40c08050 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_04_LPUART11_TXD          0x40c08010 0x40c08050 0x40c080A8 0x6 0
#define IMXRT_PAD_GPIO_LPSR_04_GPIO12_IO04           0x40c08010 0x40c08050 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_05_GPIO12_IO05           0x40c08014 0x40c08054 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_05_LPI2C5_SCL            0x40c08014 0x40c08054 0x40c08084 0x0 0
#define IMXRT_PAD_GPIO_LPSR_05_LPSPI5_SIN            0x40c08014 0x40c08054 0x40c0809C 0x1 0
#define IMXRT_PAD_GPIO_LPSR_05_SAI4_MCLK             0x40c08014 0x40c08054 0x40c080C8 0x2 1
#define IMXRT_PAD_GPIO_LPSR_05_LPUART12_CTS_B        0x40c08014 0x40c08054 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_05_GPIO_MUX6_IO05        0x40c08014 0x40c08054 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_05_LPUART11_RXD          0x40c08014 0x40c08054 0x40c080A4 0x6 0
#define IMXRT_PAD_GPIO_LPSR_05_NMI_GLUE_NMI          0x40c08014 0x40c08054 0x40c080C4 0x7 0

