RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_LPSR_06_LPI2C6_SDA            0x40c08018 0x40c08058 0x40c08090 0x0 0
#define IMXRT_PAD_GPIO_LPSR_06_SAI4_RX_DATA          0x40c08018 0x40c08058 0x40c080D0 0x2 0
#define IMXRT_PAD_GPIO_LPSR_06_LPUART12_TXD          0x40c08018 0x40c08058 0x40c080B0 0x3 1
#define IMXRT_PAD_GPIO_LPSR_06_LPSPI6_PCS3           0x40c08018 0x40c08058 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_06_GPIO_MUX6_IO06        0x40c08018 0x40c08058 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_06_FLEXCAN3_TX           0x40c08018 0x40c08058 0          0x6 0
#define IMXRT_PAD_GPIO_LPSR_06_PIT2_TRIGGER3         0x40c08018 0x40c08058 0          0x7 0
#define IMXRT_PAD_GPIO_LPSR_06_LPSPI5_PCS1           0x40c08018 0x40c08058 0          0x8 0
#define IMXRT_PAD_GPIO_LPSR_06_GPIO12_IO06           0x40c08018 0x40c08058 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_07_LPI2C6_SCL            0x40c0801C 0x40c0805C 0x40c0808C 0x0 0
#define IMXRT_PAD_GPIO_LPSR_07_SAI4_RX_BCLK          0x40c0801C 0x40c0805C 0x40c080CC 0x2 0
#define IMXRT_PAD_GPIO_LPSR_07_LPUART12_RXD          0x40c0801C 0x40c0805C 0x40c080AC 0x3 1
#define IMXRT_PAD_GPIO_LPSR_07_LPSPI6_PCS2           0x40c0801C 0x40c0805C 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_07_GPIO_MUX6_IO07        0x40c0801C 0x40c0805C 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_07_FLEXCAN3_RX           0x40c0801C 0x40c0805C 0x40c08080 0x6 1
#define IMXRT_PAD_GPIO_LPSR_07_PIT2_TRIGGER2         0x40c0801C 0x40c0805C 0          0x7 0
#define IMXRT_PAD_GPIO_LPSR_07_LPSPI5_PCS2           0x40c0801C 0x40c0805C 0          0x8 0
#define IMXRT_PAD_GPIO_LPSR_07_GPIO12_IO07           0x40c0801C 0x40c0805C 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_08_GPIO12_IO08           0x40c08020 0x40c08060 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_08_LPUART11_TXD          0x40c08020 0x40c08060 0x40c080A8 0x0 1
#define IMXRT_PAD_GPIO_LPSR_08_FLEXCAN3_TX           0x40c08020 0x40c08060 0          0x1 0
#define IMXRT_PAD_GPIO_LPSR_08_SAI4_RX_SYNC          0x40c08020 0x40c08060 0x40c080D4 0x2 0
#define IMXRT_PAD_GPIO_LPSR_08_MIC_CLK               0x40c08020 0x40c08060 0          0x3 0
#define IMXRT_PAD_GPIO_LPSR_08_LPSPI6_PCS1           0x40c08020 0x40c08060 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_08_GPIO_MUX6_IO08        0x40c08020 0x40c08060 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_08_LPI2C5_SDA            0x40c08020 0x40c08060 0x40c08088 0x6 1
#define IMXRT_PAD_GPIO_LPSR_08_PIT2_TRIGGER1         0x40c08020 0x40c08060 0          0x7 0
#define IMXRT_PAD_GPIO_LPSR_08_LPSPI5_PCS3           0x40c08020 0x40c08060 0          0x8 0

#define IMXRT_PAD_GPIO_LPSR_09_GPIO12_IO09           0x40c08024 0x40c08064 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_09_LPUART11_RXD          0x40c08024 0x40c08064 0x40c080A4 0x0 1
#define IMXRT_PAD_GPIO_LPSR_09_FLEXCAN3_RX           0x40c08024 0x40c08064 0x40c08080 0x1 2
#define IMXRT_PAD_GPIO_LPSR_09_PIT2_TRIGGER0         0x40c08024 0x40c08064 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_09_MIC_BITSTREAM0        0x40c08024 0x40c08064 0x40c080B4 0x3 1
#define IMXRT_PAD_GPIO_LPSR_09_LPSPI6_PCS0           0x40c08024 0x40c08064 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_09_GPIO_MUX6_IO09        0x40c08024 0x40c08064 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_09_LPI2C5_SCL            0x40c08024 0x40c08064 0x40c08084 0x6 1
#define IMXRT_PAD_GPIO_LPSR_09_SAI4_TX_DATA          0x40c08024 0x40c08064 0          0x7 0

#define IMXRT_PAD_GPIO_LPSR_10_GPIO12_IO10           0x40c08028 0x40c08068 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_10_JTAG_MUX_TRSTB        0x40c08028 0x40c08068 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_10_LPUART11_CTS_B        0x40c08028 0x40c08068 0          0x1 0
#define IMXRT_PAD_GPIO_LPSR_10_LPI2C6_SDA            0x40c08028 0x40c08068 0x40c08090 0x2 1
#define IMXRT_PAD_GPIO_LPSR_10_MIC_BITSTREAM1        0x40c08028 0x40c08068 0x40c080B8 0x3 0
#define IMXRT_PAD_GPIO_LPSR_10_LPSPI6_SCK            0x40c08028 0x40c08068 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_10_GPIO_MUX6_IO10        0x40c08028 0x40c08068 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_10_LPI2C5_SCLS           0x40c08028 0x40c08068 0          0x6 0
#define IMXRT_PAD_GPIO_LPSR_10_SAI4_TX_SYNC          0x40c08028 0x40c08068 0x40c080DC 0x7 1
#define IMXRT_PAD_GPIO_LPSR_10_LPUART12_TXD          0x40c08028 0x40c08068 0x40c080B0 0x8 2

#define IMXRT_PAD_GPIO_LPSR_11_JTAG_MUX_TDO          0x40c0802C 0x40c0806C 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_11_LPUART11_RTS_B        0x40c0802C 0x40c0806C 0          0x1 0
#define IMXRT_PAD_GPIO_LPSR_11_LPI2C6_SCL            0x40c0802C 0x40c0806C 0x40c0808C 0x2 1
#define IMXRT_PAD_GPIO_LPSR_11_MIC_BITSTREAM2        0x40c0802C 0x40c0806C 0x40c080BC 0x3 0
#define IMXRT_PAD_GPIO_LPSR_11_LPSPI6_SOUT           0x40c0802C 0x40c0806C 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_11_GPIO_MUX6_IO11        0x40c0802C 0x40c0806C 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_11_LPI2C5_SDAS           0x40c0802C 0x40c0806C 0          0x6 0
#define IMXRT_PAD_GPIO_LPSR_11_ARM_TRACE_SWO         0x40c0802C 0x40c0806C 0          0x7 0
#define IMXRT_PAD_GPIO_LPSR_11_LPUART12_RXD          0x40c0802C 0x40c0806C 0x40c080AC 0x8 2
#define IMXRT_PAD_GPIO_LPSR_11_GPIO12_IO11           0x40c0802C 0x40c0806C 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_12_GPIO12_IO12           0x40c08030 0x40c08070 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_12_JTAG_MUX_TDI          0x40c08030 0x40c08070 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_12_PIT2_TRIGGER0         0x40c08030 0x40c08070 0          0x1 0
#define IMXRT_PAD_GPIO_LPSR_12_MIC_BITSTREAM3        0x40c08030 0x40c08070 0x40c080C0 0x3 0
#define IMXRT_PAD_GPIO_LPSR_12_LPSPI6_SIN            0x40c08030 0x40c08070 0          0x4 0
#define IMXRT_PAD_GPIO_LPSR_12_GPIO_MUX6_IO12        0x40c08030 0x40c08070 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_12_LPI2C5_HREQ           0x40c08030 0x40c08070 0          0x6 0
#define IMXRT_PAD_GPIO_LPSR_12_SAI4_TX_BCLK          0x40c08030 0x40c08070 0x40c080D8 0x7 1
#define IMXRT_PAD_GPIO_LPSR_12_LPSPI5_SCK            0x40c08030 0x40c08070 0x40c08098 0x8 1

#define IMXRT_PAD_GPIO_LPSR_13_GPIO12_IO13           0x40c08034 0x40c08074 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_13_JTAG_MUX_MOD          0x40c08034 0x40c08074 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_13_MIC_BITSTREAM1        0x40c08034 0x40c08074 0x40c080B8 0x1 1
#define IMXRT_PAD_GPIO_LPSR_13_PIT2_TRIGGER1         0x40c08034 0x40c08074 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_13_GPIO_MUX6_IO13        0x40c08034 0x40c08074 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_13_SAI4_RX_DATA          0x40c08034 0x40c08074 0x40c080D0 0x7 1
#define IMXRT_PAD_GPIO_LPSR_13_LPSPI5_PCS0           0x40c08034 0x40c08074 0x40c08094 0x8 1

