RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_LPSR_14_JTAG_MUX_TCK          0x40c08038 0x40c08078 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_14_MIC_BITSTREAM2        0x40c08038 0x40c08078 0x40c080BC 0x1 1
#define IMXRT_PAD_GPIO_LPSR_14_PIT2_TRIGGER2         0x40c08038 0x40c08078 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_14_GPIO_MUX6_IO14        0x40c08038 0x40c08078 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_14_SAI4_RX_BCLK          0x40c08038 0x40c08078 0x40c080CC 0x7 1
#define IMXRT_PAD_GPIO_LPSR_14_LPSPI5_SOUT           0x40c08038 0x40c08078 0x40c080A0 0x8 1
#define IMXRT_PAD_GPIO_LPSR_14_GPIO12_IO14           0x40c08038 0x40c08078 0          0xA 0

#define IMXRT_PAD_GPIO_LPSR_15_GPIO12_IO15           0x40c0803C 0x40c0807C 0          0xA 0
#define IMXRT_PAD_GPIO_LPSR_15_JTAG_MUX_TMS          0x40c0803C 0x40c0807C 0          0x0 0
#define IMXRT_PAD_GPIO_LPSR_15_MIC_BITSTREAM3        0x40c0803C 0x40c0807C 0x40c080C0 0x1 1
#define IMXRT_PAD_GPIO_LPSR_15_PIT2_TRIGGER3         0x40c0803C 0x40c0807C 0          0x2 0
#define IMXRT_PAD_GPIO_LPSR_15_GPIO_MUX6_IO15        0x40c0803C 0x40c0807C 0          0x5 0
#define IMXRT_PAD_GPIO_LPSR_15_SAI4_RX_SYNC          0x40c0803C 0x40c0807C 0x40c080D4 0x7 1
#define IMXRT_PAD_GPIO_LPSR_15_LPSPI5_SIN            0x40c0803C 0x40c0807C 0x40c0809C 0x8 1

/* SNVS pins. Base address is 0x40c94000 */

#define IMXRT_PAD_WAKEUP_DIG_GPIO13_IO00               0x40c94000 0x40c94040 0 0x5 0
#define IMXRT_PAD_WAKEUP_DIG_NMI_GLUE_NMI              0x40c94000 0x40c94040 0x40C080C4 0x7 1

#define IMXRT_PAD_PMIC_ON_REQ_DIG_SNVS_LP_PMIC_ON_REQ  0x40c94004 0x40c94044 0 0x0 0
#define IMXRT_PAD_PMIC_ON_REQ_DIG_GPIO13_IO01          0x40c94004 0x40c94044 0 0x5 0

#define IMXRT_PAD_PMIC_STBY_REQ_DIG_CCM_PMIC_VSTBY_REQ 0x40c94008 0x40c94048 0 0x0 0
#define IMXRT_PAD_PMIC_STBY_REQ_DIG_GPIO13_IO02        0x40c94008 0x40c94048 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_00_DIG_SNVS_TAMPER0        0x40c9400C 0x40c9404C 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_00_DIG_GPIO13_IO03         0x40c9400C 0x40c9404C 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_01_DIG_SNVS_TAMPER1        0x40c94010 0x40c94050 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_01_DIG_GPIO13_IO04         0x40c94010 0x40c94050 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_02_DIG_SNVS_TAMPER2        0x40c94014 0x40c94054 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_02_DIG_GPIO13_IO05         0x40c94014 0x40c94054 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_03_DIG_SNVS_TAMPER3        0x40c94018 0x40c94058 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_03_DIG_GPIO13_IO06         0x40c94018 0x40c94058 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_04_DIG_SNVS_TAMPER4        0x40c9401C 0x40c9405C 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_04_DIG_GPIO13_IO07         0x40c9401C 0x40c9405C 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_05_DIG_SNVS_TAMPER5        0x40c94020 0x40c94060 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_05_DIG_GPIO13_IO08         0x40c94020 0x40c94060 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_06_DIG_SNVS_TAMPER6        0x40c94024 0x40c94064 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_06_DIG_GPIO13_IO09         0x40c94024 0x40c94064 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_07_DIG_SNVS_TAMPER7        0x40c94028 0x40c94068 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_07_DIG_GPIO13_IO10         0x40c94028 0x40c94068 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_08_DIG_SNVS_TAMPER8        0x40c9402C 0x40c9406C 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_08_DIG_GPIO13_IO11         0x40c9402C 0x40c9406C 0 0x5 0

#define IMXRT_PAD_GPIO_SNVS_09_DIG_SNVS_TAMPER9        0x40c94030 0x40c94070 0 0x0 0
#define IMXRT_PAD_GPIO_SNVS_09_DIG_GPIO13_IO12         0x40c94030 0x40c94070 0 0x5 0

#define IMXRT_PAD_TEST_MODE_DIG                        0          0x40c94034 0 0   0

#define IMXRT_PAD_POR_B_DIG                            0          0x40c94038 0 0   0

#define IMXRT_PAD_ONOFF_DIG                            0          0x40c9403C 0 0   0

/* Normal pins. Base address is 0x400e8000 */

#define IMXRT_PAD_GPIO_EMC_B1_00_SEMC_DATA00                   0x400e8010 0x400e8254 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A               0x400e8010 0x400e8254 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_00_GPIO_MUX1_IO00                0x400e8010 0x400e8254 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_00_FLEXIO1_D00                   0x400e8010 0x400e8254 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_00_GPIO7_IO00                    0x400e8010 0x400e8254 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_01_GPIO7_IO01                    0x400e8014 0x400e8258 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_01_SEMC_DATA01                   0x400e8014 0x400e8258 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B               0x400e8014 0x400e8258 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_01_GPIO_MUX1_IO01                0x400e8014 0x400e8258 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_01_FLEXIO1_D01                   0x400e8014 0x400e8258 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_02_SEMC_DATA02                   0x400e8018 0x400e825C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A               0x400e8018 0x400e825C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_02_GPIO_MUX1_IO02                0x400e8018 0x400e825C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_02_FLEXIO1_D02                   0x400e8018 0x400e825C 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_02_GPIO7_IO02                    0x400e8018 0x400e825C 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_03_SEMC_DATA03                   0x400e801C 0x400e8260 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_03_FLEXPWM4_PWM1_B               0x400e801C 0x400e8260 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_03_GPIO_MUX1_IO03                0x400e801C 0x400e8260 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_03_FLEXIO1_D03                   0x400e801C 0x400e8260 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_03_GPIO7_IO03                    0x400e801C 0x400e8260 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_04_GPIO7_IO04                    0x400e8020 0x400e8264 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_04_SEMC_DATA04                   0x400e8020 0x400e8264 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A               0x400e8020 0x400e8264 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_04_GPIO_MUX1_IO04                0x400e8020 0x400e8264 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_04_FLEXIO1_D04                   0x400e8020 0x400e8264 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_05_SEMC_DATA05                   0x400e8024 0x400e8268 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_05_FLEXPWM4_PWM2_B               0x400e8024 0x400e8268 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_05_GPIO_MUX1_IO05                0x400e8024 0x400e8268 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_05_FLEXIO1_D05                   0x400e8024 0x400e8268 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_05_GPIO7_IO05                    0x400e8024 0x400e8268 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_06_SEMC_DATA06                   0x400e8028 0x400e826C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_06_FLEXPWM2_PWM0_A               0x400e8028 0x400e826C 0x400e8518 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_06_GPIO_MUX1_IO06                0x400e8028 0x400e826C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_06_FLEXIO1_D06                   0x400e8028 0x400e826C 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_06_GPIO7_IO06                    0x400e8028 0x400e826C 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_07_GPIO7_IO07                    0x400e802C 0x400e8270 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_07_SEMC_DATA07                   0x400e802C 0x400e8270 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_07_FLEXPWM2_PWM0_B               0x400e802C 0x400e8270 0x400e8524 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_07_GPIO_MUX1_IO07                0x400e802C 0x400e8270 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_07_FLEXIO1_D07                   0x400e802C 0x400e8270 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_08_SEMC_DM00                     0x400e8030 0x400e8274 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_08_FLEXPWM2_PWM1_A               0x400e8030 0x400e8274 0x400e851C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_08_GPIO_MUX1_IO08                0x400e8030 0x400e8274 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_08_FLEXIO1_D08                   0x400e8030 0x400e8274 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_08_GPIO7_IO08                    0x400e8030 0x400e8274 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_09_SEMC_ADDR00                   0x400e8034 0x400e8278 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_09_FLEXPWM2_PWM1_B               0x400e8034 0x400e8278 0x400e8528 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_09_GPT5_CAPTURE1                 0x400e8034 0x400e8278 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_09_GPIO_MUX1_IO09                0x400e8034 0x400e8278 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_09_FLEXIO1_D09                   0x400e8034 0x400e8278 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_09_GPIO7_IO09                    0x400e8034 0x400e8278 0          0xA 0

