RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B1_10_SEMC_ADDR01                   0x400e8038 0x400e827C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_10_FLEXPWM2_PWM2_A               0x400e8038 0x400e827C 0x400e8520 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_10_GPT5_CAPTURE2                 0x400e8038 0x400e827C 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_10_GPIO_MUX1_IO10                0x400e8038 0x400e827C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_10_FLEXIO1_D10                   0x400e8038 0x400e827C 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_10_GPIO7_IO10                    0x400e8038 0x400e827C 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_11_GPIO7_IO11                    0x400e803C 0x400e8280 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_11_SEMC_ADDR02                   0x400e803C 0x400e8280 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_11_FLEXPWM2_PWM2_B               0x400e803C 0x400e8280 0x400e852C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_11_GPT5_COMPARE1                 0x400e803C 0x400e8280 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_11_GPIO_MUX1_IO11                0x400e803C 0x400e8280 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_11_FLEXIO1_D11                   0x400e803C 0x400e8280 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_12_SEMC_ADDR03                   0x400e8040 0x400e8284 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_12_XBAR1_INOUT04                 0x400e8040 0x400e8284 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_12_GPT5_COMPARE2                 0x400e8040 0x400e8284 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_12_GPIO_MUX1_IO12                0x400e8040 0x400e8284 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_12_FLEXIO1_D12                   0x400e8040 0x400e8284 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_12_GPIO7_IO12                    0x400e8040 0x400e8284 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_13_SEMC_ADDR04                   0x400e8044 0x400e8288 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_13_XBAR1_INOUT05                 0x400e8044 0x400e8288 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_13_GPT5_COMPARE3                 0x400e8044 0x400e8288 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_13_GPIO_MUX1_IO13                0x400e8044 0x400e8288 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_13_FLEXIO1_D13                   0x400e8044 0x400e8288 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_13_GPIO7_IO13                    0x400e8044 0x400e8288 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_14_GPIO7_IO14                    0x400e8048 0x400e828C 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_14_SEMC_ADDR05                   0x400e8048 0x400e828C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_14_XBAR1_INOUT06                 0x400e8048 0x400e828C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_14_GPT5_CLK                      0x400e8048 0x400e828C 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_14_GPIO_MUX1_IO14                0x400e8048 0x400e828C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_14_FLEXIO1_D14                   0x400e8048 0x400e828C 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_15_SEMC_ADDR06                   0x400e804C 0x400e8290 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_15_XBAR1_INOUT07                 0x400e804C 0x400e8290 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_15_GPIO_MUX1_IO15                0x400e804C 0x400e8290 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_15_FLEXIO1_D15                   0x400e804C 0x400e8290 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_15_GPIO7_IO15                    0x400e804C 0x400e8290 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_16_SEMC_ADDR07                   0x400e8050 0x400e8294 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_16_XBAR1_INOUT08                 0x400e8050 0x400e8294 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_16_GPIO_MUX1_IO16                0x400e8050 0x400e8294 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_16_FLEXIO1_D16                   0x400e8050 0x400e8294 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_16_GPIO7_IO16                    0x400e8050 0x400e8294 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_17_GPIO7_IO17                    0x400e8054 0x400e8298 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_17_SEMC_ADDR08                   0x400e8054 0x400e8298 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_17_FLEXPWM4_PWM3_A               0x400e8054 0x400e8298 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_17_TMR1_TIMER0                   0x400e8054 0x400e8298 0x400e863C 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_17_GPIO_MUX1_IO17                0x400e8054 0x400e8298 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_17_FLEXIO1_D17                   0x400e8054 0x400e8298 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_18_SEMC_ADDR09                   0x400e8058 0x400e829C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_18_FLEXPWM4_PWM3_B               0x400e8058 0x400e829C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_18_TMR2_TIMER0                   0x400e8058 0x400e829C 0x400e8648 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_18_GPIO_MUX1_IO18                0x400e8058 0x400e829C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_18_FLEXIO1_D18                   0x400e8058 0x400e829C 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_18_GPIO7_IO18                    0x400e8058 0x400e829C 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_19_SEMC_ADDR11                   0x400e805C 0x400e82A0 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_19_FLEXPWM2_PWM3_A               0x400e805C 0x400e82A0 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_19_TMR3_TIMER0                   0x400e805C 0x400e82A0 0x400e8654 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_19_GPIO_MUX1_IO19                0x400e805C 0x400e82A0 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_19_FLEXIO1_D19                   0x400e805C 0x400e82A0 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_19_GPIO7_IO19                    0x400e805C 0x400e82A0 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_20_SEMC_ADDR12                   0x400e8060 0x400e82A4 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_20_FLEXPWM2_PWM3_B               0x400e8060 0x400e82A4 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_20_TMR4_TIMER0                   0x400e8060 0x400e82A4 0x400e8660 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_20_GPIO_MUX1_IO20                0x400e8060 0x400e82A4 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_20_FLEXIO1_D20                   0x400e8060 0x400e82A4 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_20_GPIO7_IO20                    0x400e8060 0x400e82A4 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_21_GPIO7_IO21                    0x400e8064 0x400e82A8 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_21_SEMC_BA0                      0x400e8064 0x400e82A8 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_21_FLEXPWM3_PWM3_A               0x400e8064 0x400e82A8 0x400e853C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_21_GPIO_MUX1_IO21                0x400e8064 0x400e82A8 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_21_FLEXIO1_D21                   0x400e8064 0x400e82A8 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_22_GPIO7_IO22                    0x400e8068 0x400e82AC 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_22_SEMC_BA1                      0x400e8068 0x400e82AC 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_22_FLEXPWM3_PWM3_B               0x400e8068 0x400e82AC 0x400e854C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_22_GPIO_MUX1_IO22                0x400e8068 0x400e82AC 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_22_FLEXIO1_D22                   0x400e8068 0x400e82AC 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_23_SEMC_ADDR10                   0x400e806C 0x400e82B0 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_23_FLEXPWM1_PWM0_A               0x400e806C 0x400e82B0 0x400e8500 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_23_GPIO_MUX1_IO23                0x400e806C 0x400e82B0 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_23_FLEXIO1_D23                   0x400e806C 0x400e82B0 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_23_GPIO7_IO23                    0x400e806C 0x400e82B0 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_24_GPIO7_IO24                    0x400e8070 0x400e82B4 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_24_SEMC_CAS                      0x400e8070 0x400e82B4 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_24_FLEXPWM1_PWM0_B               0x400e8070 0x400e82B4 0x400e850C 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_24_GPIO_MUX1_IO24                0x400e8070 0x400e82B4 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_24_FLEXIO1_D24                   0x400e8070 0x400e82B4 0          0x8 0

