RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B1_25_GPIO7_IO25                    0x400e8074 0x400e82B8 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_25_SEMC_RAS                      0x400e8074 0x400e82B8 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_25_FLEXPWM1_PWM1_A               0x400e8074 0x400e82B8 0x400e8504 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_25_GPIO_MUX1_IO25                0x400e8074 0x400e82B8 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_25_FLEXIO1_D25                   0x400e8074 0x400e82B8 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_26_SEMC_CLK                      0x400e8078 0x400e82BC 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_26_FLEXPWM1_PWM1_B               0x400e8078 0x400e82BC 0x400e8510 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_26_GPIO_MUX1_IO26                0x400e8078 0x400e82BC 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_26_FLEXIO1_D26                   0x400e8078 0x400e82BC 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_26_GPIO7_IO26                    0x400e8078 0x400e82BC 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_27_GPIO7_IO27                    0x400e807C 0x400e82C0 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_27_SEMC_CKE                      0x400e807C 0x400e82C0 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_27_FLEXPWM1_PWM2_A               0x400e807C 0x400e82C0 0x400e8508 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_27_GPIO_MUX1_IO27                0x400e807C 0x400e82C0 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_27_FLEXIO1_D27                   0x400e807C 0x400e82C0 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_28_GPIO7_IO28                    0x400e8080 0x400e82C4 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_28_SEMC_WE                       0x400e8080 0x400e82C4 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_28_FLEXPWM1_PWM2_B               0x400e8080 0x400e82C4 0x400e8514 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_28_GPIO_MUX1_IO28                0x400e8080 0x400e82C4 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_28_FLEXIO1_D28                   0x400e8080 0x400e82C4 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_29_SEMC_CS0                      0x400e8084 0x400e82C8 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_29_FLEXPWM3_PWM0_A               0x400e8084 0x400e82C8 0x400e8530 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_29_GPIO_MUX1_IO29                0x400e8084 0x400e82C8 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_29_FLEXIO1_D29                   0x400e8084 0x400e82C8 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_29_GPIO7_IO29                    0x400e8084 0x400e82C8 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_30_SEMC_DATA08                   0x400e8088 0x400e82CC 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_30_FLEXPWM3_PWM0_B               0x400e8088 0x400e82CC 0x400e8540 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_30_GPIO_MUX1_IO30                0x400e8088 0x400e82CC 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_30_FLEXIO1_D30                   0x400e8088 0x400e82CC 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B1_30_GPIO7_IO30                    0x400e8088 0x400e82CC 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_31_GPIO7_IO31                    0x400e808C 0x400e82D0 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_31_SEMC_DATA09                   0x400e808C 0x400e82D0 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_31_FLEXPWM3_PWM1_A               0x400e808C 0x400e82D0 0x400e8534 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_31_GPIO_MUX1_IO31                0x400e808C 0x400e82D0 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_31_FLEXIO1_D31                   0x400e808C 0x400e82D0 0          0x8 0

#define IMXRT_PAD_GPIO_EMC_B1_32_GPIO8_IO00                    0x400e8090 0x400e82D4 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_32_SEMC_DATA10                   0x400e8090 0x400e82D4 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_32_FLEXPWM3_PWM1_B               0x400e8090 0x400e82D4 0x400e8544 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_32_GPIO_MUX2_IO00                0x400e8090 0x400e82D4 0          0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_33_SEMC_DATA11                   0x400e8094 0x400e82D8 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_33_FLEXPWM3_PWM2_A               0x400e8094 0x400e82D8 0x400e8538 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_33_GPIO_MUX2_IO01                0x400e8094 0x400e82D8 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_33_GPIO8_IO01                    0x400e8094 0x400e82D8 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_34_GPIO8_IO02                    0x400e8098 0x400e82DC 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_34_SEMC_DATA12                   0x400e8098 0x400e82DC 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_34_FLEXPWM3_PWM2_B               0x400e8098 0x400e82DC 0x400e8548 0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_34_GPIO_MUX2_IO02                0x400e8098 0x400e82DC 0          0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_35_GPIO8_IO03                    0x400e809C 0x400e82E0 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_35_SEMC_DATA13                   0x400e809C 0x400e82E0 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_35_XBAR1_INOUT09                 0x400e809C 0x400e82E0 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_35_GPIO_MUX2_IO03                0x400e809C 0x400e82E0 0          0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_36_SEMC_DATA14                   0x400e80A0 0x400e82E4 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_36_XBAR1_INOUT10                 0x400e80A0 0x400e82E4 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_36_GPIO_MUX2_IO04                0x400e80A0 0x400e82E4 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_36_GPIO8_IO04                    0x400e80A0 0x400e82E4 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_37_GPIO8_IO05                    0x400e80A4 0x400e82E8 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_37_SEMC_DATA15                   0x400e80A4 0x400e82E8 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_37_XBAR1_INOUT11                 0x400e80A4 0x400e82E8 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_37_GPIO_MUX2_IO05                0x400e80A4 0x400e82E8 0          0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_38_GPIO8_IO06                    0x400e80A8 0x400e82EC 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_38_SEMC_DM01                     0x400e80A8 0x400e82EC 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_38_FLEXPWM1_PWM3_A               0x400e80A8 0x400e82EC 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_38_TMR1_TIMER1                   0x400e80A8 0x400e82EC 0x400e8640 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_38_GPIO_MUX2_IO06                0x400e80A8 0x400e82EC 0          0x5 0

#define IMXRT_PAD_GPIO_EMC_B1_39_SEMC_DQS                      0x400e80AC 0x400e82F0 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_39_FLEXPWM1_PWM3_B               0x400e80AC 0x400e82F0 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_39_TMR2_TIMER1                   0x400e80AC 0x400e82F0 0x400e864C 0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_39_GPIO_MUX2_IO07                0x400e80AC 0x400e82F0 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_39_GPIO8_IO07                    0x400e80AC 0x400e82F0 0          0xA 0

