RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B1_40_SEMC_RDY                      0x400e80B0 0x400e82F4 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_40_XBAR1_INOUT12                 0x400e80B0 0x400e82F4 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_40_MQS_RIGHT                     0x400e80B0 0x400e82F4 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_40_LPUART6_TXD                   0x400e80B0 0x400e82F4 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B1_40_GPIO_MUX2_IO08                0x400e80B0 0x400e82F4 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_40_ENET_1G_MDC                   0x400e80B0 0x400e82F4 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B1_40_CCM_CLKO1                     0x400e80B0 0x400e82F4 0          0x9 0
#define IMXRT_PAD_GPIO_EMC_B1_40_GPIO8_IO08                    0x400e80B0 0x400e82F4 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B1_41_GPIO8_IO09                    0x400e80B4 0x400e82F8 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B1_41_SEMC_CSX00                    0x400e80B4 0x400e82F8 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B1_41_XBAR1_INOUT13                 0x400e80B4 0x400e82F8 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B1_41_MQS_LEFT                      0x400e80B4 0x400e82F8 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B1_41_LPUART6_RXD                   0x400e80B4 0x400e82F8 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B1_41_FLEXSPI2_B_DATA07             0x400e80B4 0x400e82F8 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B1_41_GPIO_MUX2_IO09                0x400e80B4 0x400e82F8 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B1_41_ENET_1G_MDIO                  0x400e80B4 0x400e82F8 0x400e84C8 0x7 0
#define IMXRT_PAD_GPIO_EMC_B1_41_CCM_CLKO2                     0x400e80B4 0x400e82F8 0          0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_00_SEMC_DATA16                   0x400e80B8 0x400e82FC 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_00_CCM_ENET_REF_CLK_25M          0x400e80B8 0x400e82FC 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_00_TMR3_TIMER1                   0x400e80B8 0x400e82FC 0x400e8658 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_00_LPUART6_CTS_B                 0x400e80B8 0x400e82FC 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_00_FLEXSPI2_B_DATA06             0x400e80B8 0x400e82FC 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_00_GPIO_MUX2_IO10                0x400e80B8 0x400e82FC 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_00_XBAR1_INOUT20                 0x400e80B8 0x400e82FC 0x400e86D8 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_00_ENET_QOS_1588_EVENT1_OUT      0x400e80B8 0x400e82FC 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_00_LPSPI1_SCK                    0x400e80B8 0x400e82FC 0x400e85D0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_00_LPI2C2_SCL                    0x400e80B8 0x400e82FC 0x400e85B4 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_00_GPIO8_IO10                    0x400e80B8 0x400e82FC 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_00_FLEXPWM3_PWM0_A               0x400e80B8 0x400e82FC 0x400e8530 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_01_SEMC_DATA17                   0x400e80BC 0x400e8300 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_01_USDHC2_CD_B                   0x400e80BC 0x400e8300 0x400e86D0 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_01_TMR4_TIMER1                   0x400e80BC 0x400e8300 0x400e8664 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_01_LPUART6_RTS_B                 0x400e80BC 0x400e8300 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_01_FLEXSPI2_B_DATA05             0x400e80BC 0x400e8300 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_01_GPIO_MUX2_IO11                0x400e80BC 0x400e8300 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_01_XBAR1_INOUT21                 0x400e80BC 0x400e8300 0x400e86DC 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_01_ENET_QOS_1588_EVENT1_IN       0x400e80BC 0x400e8300 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_01_LPSPI1_PCS0                   0x400e80BC 0x400e8300 0x400e85CC 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_01_LPI2C2_SDA                    0x400e80BC 0x400e8300 0x400e85B8 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_01_GPIO8_IO11                    0x400e80BC 0x400e8300 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_01_FLEXPWM3_PWM0_B               0x400e80BC 0x400e8300 0x400e8540 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_02_SEMC_DATA18                   0x400e80C0 0x400e8304 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_02_USDHC2_WP                     0x400e80C0 0x400e8304 0x400e86D4 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_02_VIDEO_MUX_CSI_DATA23          0x400e80C0 0x400e8304 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_02_FLEXSPI2_B_DATA04             0x400e80C0 0x400e8304 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_02_GPIO_MUX2_IO12                0x400e80C0 0x400e8304 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_02_XBAR1_INOUT22                 0x400e80C0 0x400e8304 0x400e86E0 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_02_ENET_QOS_1588_EVENT1_AUX_IN   0x400e80C0 0x400e8304 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_02_LPSPI1_SOUT                   0x400e80C0 0x400e8304 0x400e85D8 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_02_GPIO8_IO12                    0x400e80C0 0x400e8304 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_02_FLEXPWM3_PWM1_A               0x400e80C0 0x400e8304 0x400e8534 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_03_SEMC_DATA19                   0x400e80C4 0x400e8308 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_03_USDHC2_VSELECT                0x400e80C4 0x400e8308 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_03_VIDEO_MUX_CSI_DATA22          0x400e80C4 0x400e8308 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_03_FLEXSPI2_B_DATA03             0x400e80C4 0x400e8308 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_03_GPIO_MUX2_IO13                0x400e80C4 0x400e8308 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_03_XBAR1_INOUT23                 0x400e80C4 0x400e8308 0x400e86E4 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_03_ENET_1G_TX_DATA03             0x400e80C4 0x400e8308 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_03_LPSPI1_SIN                    0x400e80C4 0x400e8308 0x400e85D4 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_03_GPIO8_IO13                    0x400e80C4 0x400e8308 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_03_FLEXPWM3_PWM1_B               0x400e80C4 0x400e8308 0x400e8544 0xB 1

