RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_EMC_B2_04_SEMC_DATA20                   0x400e80C8 0x400e830C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_04_USDHC2_RESET_B                0x400e80C8 0x400e830C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_04_SAI2_MCLK                     0x400e80C8 0x400e830C 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_04_VIDEO_MUX_CSI_DATA21          0x400e80C8 0x400e830C 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_04_FLEXSPI2_B_DATA02             0x400e80C8 0x400e830C 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_04_GPIO_MUX2_IO14                0x400e80C8 0x400e830C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_04_XBAR1_INOUT24                 0x400e80C8 0x400e830C 0x400e86E8 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_04_ENET_1G_TX_DATA02             0x400e80C8 0x400e830C 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_04_LPSPI3_SCK                    0x400e80C8 0x400e830C 0x400e8600 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_04_GPIO8_IO14                    0x400e80C8 0x400e830C 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_04_FLEXPWM3_PWM2_A               0x400e80C8 0x400e830C 0x400e8538 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_05_SEMC_DATA21                   0x400e80CC 0x400e8310 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_05_GPT3_CLK                      0x400e80CC 0x400e8310 0x400e8598 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_05_SAI2_RX_SYNC                  0x400e80CC 0x400e8310 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_05_VIDEO_MUX_CSI_DATA20          0x400e80CC 0x400e8310 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_05_FLEXSPI2_B_DATA01             0x400e80CC 0x400e8310 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_05_GPIO_MUX2_IO15                0x400e80CC 0x400e8310 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_05_XBAR1_INOUT25                 0x400e80CC 0x400e8310 0x400e86EC 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_05_ENET_1G_RX_CLK                0x400e80CC 0x400e8310 0x400e84CC 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_05_LPSPI3_PCS0                   0x400e80CC 0x400e8310 0x400e85F0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_05_PIT1_TRIGGER0                 0x400e80CC 0x400e8310 0          0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_05_GPIO8_IO15                    0x400e80CC 0x400e8310 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_05_FLEXPWM3_PWM2_B               0x400e80CC 0x400e8310 0x400e8548 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_06_SEMC_DATA22                   0x400e80D0 0x400e8314 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_06_GPT3_CAPTURE1                 0x400e80D0 0x400e8314 0x400e8590 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_06_GPIO8_IO16                    0x400e80D0 0x400e8314 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_06_SAI2_RX_BCLK                  0x400e80D0 0x400e8314 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_06_FLEXPWM3_PWM3_A               0x400e80D0 0x400e8314 0x400e853C 0xB 1
#define IMXRT_PAD_GPIO_EMC_B2_06_VIDEO_MUX_CSI_DATA19          0x400e80D0 0x400e8314 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_06_FLEXSPI2_B_DATA00             0x400e80D0 0x400e8314 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_06_GPIO_MUX2_IO16                0x400e80D0 0x400e8314 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_06_XBAR1_INOUT26                 0x400e80D0 0x400e8314 0x400e86F0 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_06_ENET_1G_TX_ER                 0x400e80D0 0x400e8314 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_06_LPSPI3_SOUT                   0x400e80D0 0x400e8314 0x400e8608 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_06_PIT1_TRIGGER1                 0x400e80D0 0x400e8314 0          0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_07_SEMC_DATA23                   0x400e80D4 0x400e8318 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_07_GPT3_CAPTURE2                 0x400e80D4 0x400e8318 0x400e8594 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_07_SAI2_RX_DATA                  0x400e80D4 0x400e8318 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_07_VIDEO_MUX_CSI_DATA18          0x400e80D4 0x400e8318 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_07_FLEXSPI2_B_DQS                0x400e80D4 0x400e8318 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_07_GPIO_MUX2_IO17                0x400e80D4 0x400e8318 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_07_XBAR1_INOUT27                 0x400e80D4 0x400e8318 0x400e86F4 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_07_ENET_1G_RX_DATA03             0x400e80D4 0x400e8318 0x400e84DC 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_07_LPSPI3_SIN                    0x400e80D4 0x400e8318 0x400e8604 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_07_PIT1_TRIGGER2                 0x400e80D4 0x400e8318 0          0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_07_GPIO8_IO17                    0x400e80D4 0x400e8318 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_07_FLEXPWM3_PWM3_B               0x400e80D4 0x400e8318 0x400e854C 0xB 1

#define IMXRT_PAD_GPIO_EMC_B2_08_SEMC_DM02                     0x400e80D8 0x400e831C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_08_GPT3_COMPARE1                 0x400e80D8 0x400e831C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_08_SAI2_TX_DATA                  0x400e80D8 0x400e831C 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_08_VIDEO_MUX_CSI_DATA17          0x400e80D8 0x400e831C 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_08_FLEXSPI2_B_SS0_B              0x400e80D8 0x400e831C 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_08_GPIO_MUX2_IO18                0x400e80D8 0x400e831C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_08_XBAR1_INOUT28                 0x400e80D8 0x400e831C 0x400e86F8 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_08_ENET_1G_RX_DATA02             0x400e80D8 0x400e831C 0x400e84D8 0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_08_LPSPI3_PCS1                   0x400e80D8 0x400e831C 0x400e85F4 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_08_PIT1_TRIGGER3                 0x400e80D8 0x400e831C 0          0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_08_GPIO8_IO18                    0x400e80D8 0x400e831C 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_09_GPIO8_IO19                    0x400e80DC 0x400e8320 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_09_SEMC_DATA24                   0x400e80DC 0x400e8320 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_09_GPT3_COMPARE2                 0x400e80DC 0x400e8320 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_09_SAI2_TX_BCLK                  0x400e80DC 0x400e8320 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_09_VIDEO_MUX_CSI_DATA16          0x400e80DC 0x400e8320 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_09_FLEXSPI2_B_SCLK               0x400e80DC 0x400e8320 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_09_GPIO_MUX2_IO19                0x400e80DC 0x400e8320 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_09_XBAR1_INOUT29                 0x400e80DC 0x400e8320 0x400e86FC 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_09_ENET_1G_CRS                   0x400e80DC 0x400e8320 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_09_LPSPI3_PCS2                   0x400e80DC 0x400e8320 0x400e85F8 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_09_TMR1_TIMER0                   0x400e80DC 0x400e8320 0x400e863C 0x9 1

#define IMXRT_PAD_GPIO_EMC_B2_10_GPIO8_IO20                    0x400e80E0 0x400e8324 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_10_SEMC_DATA25                   0x400e80E0 0x400e8324 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_10_GPT3_COMPARE3                 0x400e80E0 0x400e8324 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_10_SAI2_TX_SYNC                  0x400e80E0 0x400e8324 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_10_VIDEO_MUX_CSI_FIELD           0x400e80E0 0x400e8324 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_10_FLEXSPI2_A_SCLK               0x400e80E0 0x400e8324 0x400e858C 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_10_GPIO_MUX2_IO20                0x400e80E0 0x400e8324 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_10_XBAR1_INOUT30                 0x400e80E0 0x400e8324 0x400e8700 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_10_ENET_1G_COL                   0x400e80E0 0x400e8324 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_10_LPSPI3_PCS3                   0x400e80E0 0x400e8324 0x400e85FC 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_10_TMR1_TIMER1                   0x400e80E0 0x400e8324 0x400e8640 0x9 1

#define IMXRT_PAD_GPIO_EMC_B2_11_SEMC_DATA26                   0x400e80E4 0x400e8328 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_11_SPDIF_IN                      0x400e80E4 0x400e8328 0x400e86B4 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_11_ENET_1G_TX_DATA00             0x400e80E4 0x400e8328 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_11_SAI3_RX_SYNC                  0x400e80E4 0x400e8328 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_11_FLEXSPI2_A_SS0_B              0x400e80E4 0x400e8328 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_11_GPIO_MUX2_IO21                0x400e80E4 0x400e8328 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_11_XBAR1_INOUT31                 0x400e80E4 0x400e8328 0x400e8704 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_11_EMVSIM1_IO                    0x400e80E4 0x400e8328 0x400e869C 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_11_TMR1_TIMER2                   0x400e80E4 0x400e8328 0x400e8644 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_11_GPIO8_IO21                    0x400e80E4 0x400e8328 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_12_SEMC_DATA27                   0x400e80E8 0x400e832C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_12_SPDIF_OUT                     0x400e80E8 0x400e832C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_12_ENET_1G_TX_DATA01             0x400e80E8 0x400e832C 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_12_SAI3_RX_BCLK                  0x400e80E8 0x400e832C 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_12_FLEXSPI2_A_DQS                0x400e80E8 0x400e832C 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_12_GPIO_MUX2_IO22                0x400e80E8 0x400e832C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_12_XBAR1_INOUT32                 0x400e80E8 0x400e832C 0x400e8708 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_12_EMVSIM1_CLK                   0x400e80E8 0x400e832C 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_12_TMR1_TIMER3                   0x400e80E8 0x400e832C 0          0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_12_GPIO8_IO22                    0x400e80E8 0x400e832C 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_13_GPIO8_IO23                    0x400e80EC 0x400e8330 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_13_SEMC_DATA28                   0x400e80EC 0x400e8330 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_13_ENET_1G_TX_EN                 0x400e80EC 0x400e8330 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_13_SAI3_RX_DATA                  0x400e80EC 0x400e8330 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_13_FLEXSPI2_A_DATA00             0x400e80EC 0x400e8330 0x400e857C 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_13_GPIO_MUX2_IO23                0x400e80EC 0x400e8330 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_13_XBAR1_INOUT33                 0x400e80EC 0x400e8330 0x400e870C 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_13_EMVSIM1_RST                   0x400e80EC 0x400e8330 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_13_TMR2_TIMER0                   0x400e80EC 0x400e8330 0x400e8648 0x9 1

#define IMXRT_PAD_GPIO_EMC_B2_14_SEMC_DATA29                   0x400e80F0 0x400e8334 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_14_ENET_1G_TX_CLK_IO             0x400e80F0 0x400e8334 0x400e84E8 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_14_SAI3_TX_DATA                  0x400e80F0 0x400e8334 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_14_FLEXSPI2_A_DATA01             0x400e80F0 0x400e8334 0x400e8580 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_14_GPIO_MUX2_IO24                0x400e80F0 0x400e8334 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_14_XBAR1_INOUT34                 0x400e80F0 0x400e8334 0x400e8710 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_14_SFA_ipp_do_atx_clk_under_test 0x400e80F0 0x400e8334 0          0x7 0
#define IMXRT_PAD_GPIO_EMC_B2_14_EMVSIM1_SVEN                  0x400e80F0 0x400e8334 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_14_TMR2_TIMER1                   0x400e80F0 0x400e8334 0x400e864C 0x9 1
#define IMXRT_PAD_GPIO_EMC_B2_14_GPIO8_IO24                    0x400e80F0 0x400e8334 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_15_SEMC_DATA30                   0x400e80F4 0x400e8338 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_15_ENET_1G_RX_DATA00             0x400e80F4 0x400e8338 0x400e84D0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_15_SAI3_TX_BCLK                  0x400e80F4 0x400e8338 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_15_FLEXSPI2_A_DATA02             0x400e80F4 0x400e8338 0x400e8584 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_15_GPIO_MUX2_IO25                0x400e80F4 0x400e8338 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_15_XBAR1_INOUT35                 0x400e80F4 0x400e8338 0x400e8714 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_15_EMVSIM1_PD                    0x400e80F4 0x400e8338 0x400e86A0 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_15_TMR2_TIMER2                   0x400e80F4 0x400e8338 0x400e8650 0x9 0
#define IMXRT_PAD_GPIO_EMC_B2_15_GPIO8_IO25                    0x400e80F4 0x400e8338 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_16_GPIO8_IO26                    0x400e80F8 0x400e833C 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_16_SEMC_DATA31                   0x400e80F8 0x400e833C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_16_XBAR1_INOUT14                 0x400e80F8 0x400e833C 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_16_ENET_1G_RX_DATA01             0x400e80F8 0x400e833C 0x400e84D4 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_16_SAI3_TX_SYNC                  0x400e80F8 0x400e833C 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_16_FLEXSPI2_A_DATA03             0x400e80F8 0x400e833C 0x400e8588 0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_16_GPIO_MUX2_IO26                0x400e80F8 0x400e833C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_16_EMVSIM1_POWER_FAIL            0x400e80F8 0x400e833C 0x400e86A4 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_16_TMR2_TIMER3                   0x400e80F8 0x400e833C 0          0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_17_SEMC_DM03                     0x400e80FC 0x400e8340 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_17_XBAR1_INOUT15                 0x400e80FC 0x400e8340 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_17_ENET_1G_RX_EN                 0x400e80FC 0x400e8340 0x400e84E0 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_17_SAI3_MCLK                     0x400e80FC 0x400e8340 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_17_FLEXSPI2_A_DATA04             0x400e80FC 0x400e8340 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_17_GPIO_MUX2_IO27                0x400e80FC 0x400e8340 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_17_WDOG1_ANY                     0x400e80FC 0x400e8340 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_17_TMR3_TIMER0                   0x400e80FC 0x400e8340 0x400e8654 0x9 1
#define IMXRT_PAD_GPIO_EMC_B2_17_GPIO8_IO27                    0x400e80FC 0x400e8340 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_18_SEMC_DQS4                     0x400e8100 0x400e8344 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_18_XBAR1_INOUT16                 0x400e8100 0x400e8344 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_18_ENET_1G_RX_ER                 0x400e8100 0x400e8344 0x400e84E4 0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_18_EWM_OUT_B                     0x400e8100 0x400e8344 0          0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_18_FLEXSPI2_A_DATA05             0x400e8100 0x400e8344 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_18_GPIO_MUX2_IO28                0x400e8100 0x400e8344 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_18_FLEXSPI1_A_DQS                0x400e8100 0x400e8344 0x400e8550 0x6 0
#define IMXRT_PAD_GPIO_EMC_B2_18_WDOG1_B                       0x400e8100 0x400e8344 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_18_TMR3_TIMER1                   0x400e8100 0x400e8344 0x400e8658 0x9 1
#define IMXRT_PAD_GPIO_EMC_B2_18_GPIO8_IO28                    0x400e8100 0x400e8344 0          0xA 0

#define IMXRT_PAD_GPIO_EMC_B2_19_GPIO8_IO29                    0x400e8104 0x400e8348 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_19_SEMC_CLKX00                   0x400e8104 0x400e8348 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_MDC                      0x400e8104 0x400e8348 0          0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_1G_MDC                   0x400e8104 0x400e8348 0          0x2 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_1G_REF_CLK               0x400e8104 0x400e8348 0x400e84C4 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_19_FLEXSPI2_A_DATA06             0x400e8104 0x400e8348 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_19_GPIO_MUX2_IO29                0x400e8104 0x400e8348 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_19_ENET_QOS_MDC                  0x400e8104 0x400e8348 0          0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_19_TMR3_TIMER2                   0x400e8104 0x400e8348 0x400e865C 0x9 0

#define IMXRT_PAD_GPIO_EMC_B2_20_GPIO8_IO30                    0x400e8108 0x400e834C 0          0xA 0
#define IMXRT_PAD_GPIO_EMC_B2_20_SEMC_CLKX01                   0x400e8108 0x400e834C 0          0x0 0
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_MDIO                     0x400e8108 0x400e834C 0x400e84AC 0x1 0
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_1G_MDIO                  0x400e8108 0x400e834C 0x400e84C8 0x2 1
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_QOS_REF_CLK              0x400e8108 0x400e834C 0x400e84A0 0x3 0
#define IMXRT_PAD_GPIO_EMC_B2_20_FLEXSPI2_A_DATA07             0x400e8108 0x400e834C 0          0x4 0
#define IMXRT_PAD_GPIO_EMC_B2_20_GPIO_MUX2_IO30                0x400e8108 0x400e834C 0          0x5 0
#define IMXRT_PAD_GPIO_EMC_B2_20_ENET_QOS_MDIO                 0x400e8108 0x400e834C 0x400e84EC 0x8 0
#define IMXRT_PAD_GPIO_EMC_B2_20_TMR3_TIMER3                   0x400e8108 0x400e834C 0          0x9 0

#define IMXRT_PAD_GPIO_AD_00_GPIO8_IO31                        0x400e810C 0x400e8350 0          0xA 0
#define IMXRT_PAD_GPIO_AD_00_EMVSIM1_IO                        0x400e810C 0x400e8350 0x400e869C 0x0 1
#define IMXRT_PAD_GPIO_AD_00_FLEXCAN2_TX                       0x400e810C 0x400e8350 0          0x1 0
#define IMXRT_PAD_GPIO_AD_00_ENET_1G_1588_EVENT1_IN            0x400e810C 0x400e8350 0          0x2 0
#define IMXRT_PAD_GPIO_AD_00_GPT2_CAPTURE1                     0x400e810C 0x400e8350 0          0x3 0
#define IMXRT_PAD_GPIO_AD_00_FLEXPWM1_PWM0_A                   0x400e810C 0x400e8350 0x400e8500 0x4 1
#define IMXRT_PAD_GPIO_AD_00_GPIO_MUX2_IO31                    0x400e810C 0x400e8350 0          0x5 0
#define IMXRT_PAD_GPIO_AD_00_LPUART7_TXD                       0x400e810C 0x400e8350 0x400e8630 0x6 0
#define IMXRT_PAD_GPIO_AD_00_FLEXIO2_D00                       0x400e810C 0x400e8350 0          0x8 0
#define IMXRT_PAD_GPIO_AD_00_FLEXSPI2_B_SS1_B                  0x400e810C 0x400e8350 0          0x9 0

#define IMXRT_PAD_GPIO_AD_01_GPIO9_IO00                        0x400e8110 0x400e8354 0          0xA 0
#define IMXRT_PAD_GPIO_AD_01_EMVSIM1_CLK                       0x400e8110 0x400e8354 0          0x0 0
#define IMXRT_PAD_GPIO_AD_01_FLEXCAN2_RX                       0x400e8110 0x400e8354 0x400e849C 0x1 0
#define IMXRT_PAD_GPIO_AD_01_ENET_1G_1588_EVENT1_OUT           0x400e8110 0x400e8354 0          0x2 0
#define IMXRT_PAD_GPIO_AD_01_GPT2_CAPTURE2                     0x400e8110 0x400e8354 0          0x3 0
#define IMXRT_PAD_GPIO_AD_01_FLEXPWM1_PWM0_B                   0x400e8110 0x400e8354 0x400e850C 0x4 1
#define IMXRT_PAD_GPIO_AD_01_GPIO_MUX3_IO00                    0x400e8110 0x400e8354 0          0x5 0
#define IMXRT_PAD_GPIO_AD_01_LPUART7_RXD                       0x400e8110 0x400e8354 0x400e862C 0x6 0
#define IMXRT_PAD_GPIO_AD_01_FLEXIO2_D01                       0x400e8110 0x400e8354 0          0x8 0
#define IMXRT_PAD_GPIO_AD_01_FLEXSPI2_A_SS1_B                  0x400e8110 0x400e8354 0          0x9 0

