RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_AD_02_GPIO9_IO01                        0x400e8114 0x400e8358 0          0xA 0
#define IMXRT_PAD_GPIO_AD_02_EMVSIM1_RST                       0x400e8114 0x400e8358 0          0x0 0
#define IMXRT_PAD_GPIO_AD_02_LPUART7_CTS_B                     0x400e8114 0x400e8358 0          0x1 0
#define IMXRT_PAD_GPIO_AD_02_ENET_1G_1588_EVENT2_IN            0x400e8114 0x400e8358 0          0x2 0
#define IMXRT_PAD_GPIO_AD_02_GPT2_COMPARE1                     0x400e8114 0x400e8358 0          0x3 0
#define IMXRT_PAD_GPIO_AD_02_FLEXPWM1_PWM1_A                   0x400e8114 0x400e8358 0x400e8504 0x4 1
#define IMXRT_PAD_GPIO_AD_02_GPIO_MUX3_IO01                    0x400e8114 0x400e8358 0          0x5 0
#define IMXRT_PAD_GPIO_AD_02_LPUART8_TXD                       0x400e8114 0x400e8358 0x400e8638 0x6 0
#define IMXRT_PAD_GPIO_AD_02_FLEXIO2_D02                       0x400e8114 0x400e8358 0          0x8 0
#define IMXRT_PAD_GPIO_AD_02_VIDEO_MUX_EXT_DCIC1               0x400e8114 0x400e8358 0          0x9 0

#define IMXRT_PAD_GPIO_AD_03_GPIO9_IO02                        0x400e8118 0x400e835C 0          0xA 0
#define IMXRT_PAD_GPIO_AD_03_EMVSIM1_SVEN                      0x400e8118 0x400e835C 0          0x0 0
#define IMXRT_PAD_GPIO_AD_03_LPUART7_RTS_B                     0x400e8118 0x400e835C 0          0x1 0
#define IMXRT_PAD_GPIO_AD_03_ENET_1G_1588_EVENT2_OUT           0x400e8118 0x400e835C 0          0x2 0
#define IMXRT_PAD_GPIO_AD_03_GPT2_COMPARE2                     0x400e8118 0x400e835C 0          0x3 0
#define IMXRT_PAD_GPIO_AD_03_FLEXPWM1_PWM1_B                   0x400e8118 0x400e835C 0x400e8510 0x4 1
#define IMXRT_PAD_GPIO_AD_03_GPIO_MUX3_IO02                    0x400e8118 0x400e835C 0          0x5 0
#define IMXRT_PAD_GPIO_AD_03_LPUART8_RXD                       0x400e8118 0x400e835C 0x400e8634 0x6 0
#define IMXRT_PAD_GPIO_AD_03_FLEXIO2_D03                       0x400e8118 0x400e835C 0          0x8 0
#define IMXRT_PAD_GPIO_AD_03_VIDEO_MUX_EXT_DCIC2               0x400e8118 0x400e835C 0          0x9 0

#define IMXRT_PAD_GPIO_AD_04_EMVSIM1_PD                        0x400e811C 0x400e8360 0x400e86A0 0x0 1
#define IMXRT_PAD_GPIO_AD_04_LPUART8_CTS_B                     0x400e811C 0x400e8360 0          0x1 0
#define IMXRT_PAD_GPIO_AD_04_ENET_1G_1588_EVENT3_IN            0x400e811C 0x400e8360 0          0x2 0
#define IMXRT_PAD_GPIO_AD_04_GPT2_COMPARE3                     0x400e811C 0x400e8360 0          0x3 0
#define IMXRT_PAD_GPIO_AD_04_FLEXPWM1_PWM2_A                   0x400e811C 0x400e8360 0x400e8508 0x4 1
#define IMXRT_PAD_GPIO_AD_04_GPIO_MUX3_IO03                    0x400e811C 0x400e8360 0          0x5 0
#define IMXRT_PAD_GPIO_AD_04_WDOG1_B                           0x400e811C 0x400e8360 0          0x6 0
#define IMXRT_PAD_GPIO_AD_04_FLEXIO2_D04                       0x400e811C 0x400e8360 0          0x8 0
#define IMXRT_PAD_GPIO_AD_04_TMR4_TIMER0                       0x400e811C 0x400e8360 0x400e8660 0x9 1
#define IMXRT_PAD_GPIO_AD_04_GPIO9_IO03                        0x400e811C 0x400e8360 0          0xA 0

#define IMXRT_PAD_GPIO_AD_05_EMVSIM1_POWER_FAIL                0x400e8120 0x400e8364 0x400e86A4 0x0 1
#define IMXRT_PAD_GPIO_AD_05_LPUART8_RTS_B                     0x400e8120 0x400e8364 0          0x1 0
#define IMXRT_PAD_GPIO_AD_05_ENET_1G_1588_EVENT3_OUT           0x400e8120 0x400e8364 0          0x2 0
#define IMXRT_PAD_GPIO_AD_05_GPT2_CLK                          0x400e8120 0x400e8364 0          0x3 0
#define IMXRT_PAD_GPIO_AD_05_FLEXPWM1_PWM2_B                   0x400e8120 0x400e8364 0x400e8514 0x4 1
#define IMXRT_PAD_GPIO_AD_05_GPIO_MUX3_IO04                    0x400e8120 0x400e8364 0          0x5 0
#define IMXRT_PAD_GPIO_AD_05_WDOG2_B                           0x400e8120 0x400e8364 0          0x6 0
#define IMXRT_PAD_GPIO_AD_05_FLEXIO2_D05                       0x400e8120 0x400e8364 0          0x8 0
#define IMXRT_PAD_GPIO_AD_05_TMR4_TIMER1                       0x400e8120 0x400e8364 0x400e8664 0x9 1
#define IMXRT_PAD_GPIO_AD_05_GPIO9_IO04                        0x400e8120 0x400e8364 0          0xA 0

#define IMXRT_PAD_GPIO_AD_06_USB_OTG2_OC                       0x400e8124 0x400e8368 0x400e86B8 0x0 0
#define IMXRT_PAD_GPIO_AD_06_FLEXCAN1_TX                       0x400e8124 0x400e8368 0          0x1 0
#define IMXRT_PAD_GPIO_AD_06_EMVSIM2_IO                        0x400e8124 0x400e8368 0x400e86A8 0x2 0
#define IMXRT_PAD_GPIO_AD_06_GPT3_CAPTURE1                     0x400e8124 0x400e8368 0x400e8590 0x3 1
#define IMXRT_PAD_GPIO_AD_06_VIDEO_MUX_CSI_DATA15              0x400e8124 0x400e8368 0          0x4 0
#define IMXRT_PAD_GPIO_AD_06_GPIO_MUX3_IO05                    0x400e8124 0x400e8368 0          0x5 0
#define IMXRT_PAD_GPIO_AD_06_ENET_1588_EVENT1_IN               0x400e8124 0x400e8368 0          0x6 0
#define IMXRT_PAD_GPIO_AD_06_FLEXIO2_D06                       0x400e8124 0x400e8368 0          0x8 0
#define IMXRT_PAD_GPIO_AD_06_TMR4_TIMER2                       0x400e8124 0x400e8368 0x400e8668 0x9 0
#define IMXRT_PAD_GPIO_AD_06_GPIO9_IO05                        0x400e8124 0x400e8368 0          0xA 0
#define IMXRT_PAD_GPIO_AD_06_FLEXPWM1_PWM0_X                   0x400e8124 0x400e8368 0          0xB 0

#define IMXRT_PAD_GPIO_AD_07_USB_OTG2_PWR                      0x400e8128 0x400e836C 0          0x0 0
#define IMXRT_PAD_GPIO_AD_07_FLEXCAN1_RX                       0x400e8128 0x400e836C 0x400e8498 0x1 0
#define IMXRT_PAD_GPIO_AD_07_EMVSIM2_CLK                       0x400e8128 0x400e836C 0          0x2 0
#define IMXRT_PAD_GPIO_AD_07_GPT3_CAPTURE2                     0x400e8128 0x400e836C 0x400e8594 0x3 1
#define IMXRT_PAD_GPIO_AD_07_VIDEO_MUX_CSI_DATA14              0x400e8128 0x400e836C 0          0x4 0
#define IMXRT_PAD_GPIO_AD_07_GPIO_MUX3_IO06                    0x400e8128 0x400e836C 0          0x5 0
#define IMXRT_PAD_GPIO_AD_07_ENET_1588_EVENT1_OUT              0x400e8128 0x400e836C 0          0x6 0
#define IMXRT_PAD_GPIO_AD_07_FLEXIO2_D07                       0x400e8128 0x400e836C 0          0x8 0
#define IMXRT_PAD_GPIO_AD_07_TMR4_TIMER3                       0x400e8128 0x400e836C 0          0x9 0
#define IMXRT_PAD_GPIO_AD_07_GPIO9_IO06                        0x400e8128 0x400e836C 0          0xA 0
#define IMXRT_PAD_GPIO_AD_07_FLEXPWM1_PWM1_X                   0x400e8128 0x400e836C 0          0xB 0

#define IMXRT_PAD_GPIO_AD_08_USBPHY2_OTG_ID                    0x400e812C 0x400e8370 0x400e86C4 0x0 0
#define IMXRT_PAD_GPIO_AD_08_LPI2C1_SCL                        0x400e812C 0x400e8370 0x400e85AC 0x1 0
#define IMXRT_PAD_GPIO_AD_08_EMVSIM2_RST                       0x400e812C 0x400e8370 0          0x2 0
#define IMXRT_PAD_GPIO_AD_08_GPT3_COMPARE1                     0x400e812C 0x400e8370 0          0x3 0
#define IMXRT_PAD_GPIO_AD_08_VIDEO_MUX_CSI_DATA13              0x400e812C 0x400e8370 0          0x4 0
#define IMXRT_PAD_GPIO_AD_08_GPIO_MUX3_IO07                    0x400e812C 0x400e8370 0          0x5 0
#define IMXRT_PAD_GPIO_AD_08_ENET_1588_EVENT2_IN               0x400e812C 0x400e8370 0          0x6 0
#define IMXRT_PAD_GPIO_AD_08_FLEXIO2_D08                       0x400e812C 0x400e8370 0          0x8 0
#define IMXRT_PAD_GPIO_AD_08_GPIO9_IO07                        0x400e812C 0x400e8370 0          0xA 0
#define IMXRT_PAD_GPIO_AD_08_FLEXPWM1_PWM2_X                   0x400e812C 0x400e8370 0          0xB 0

