RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_AD_09_USBPHY1_OTG_ID                    0x400e8130 0x400e8374 0x400e86C0 0x0 0
#define IMXRT_PAD_GPIO_AD_09_LPI2C1_SDA                        0x400e8130 0x400e8374 0x400e85B0 0x1 0
#define IMXRT_PAD_GPIO_AD_09_EMVSIM2_SVEN                      0x400e8130 0x400e8374 0          0x2 0
#define IMXRT_PAD_GPIO_AD_09_GPT3_COMPARE2                     0x400e8130 0x400e8374 0          0x3 0
#define IMXRT_PAD_GPIO_AD_09_VIDEO_MUX_CSI_DATA12              0x400e8130 0x400e8374 0          0x4 0
#define IMXRT_PAD_GPIO_AD_09_GPIO_MUX3_IO08                    0x400e8130 0x400e8374 0          0x5 0
#define IMXRT_PAD_GPIO_AD_09_ENET_1588_EVENT2_OUT              0x400e8130 0x400e8374 0          0x6 0
#define IMXRT_PAD_GPIO_AD_09_FLEXIO2_D09                       0x400e8130 0x400e8374 0          0x8 0
#define IMXRT_PAD_GPIO_AD_09_GPIO9_IO08                        0x400e8130 0x400e8374 0          0xA 0
#define IMXRT_PAD_GPIO_AD_09_FLEXPWM1_PWM3_X                   0x400e8130 0x400e8374 0          0xB 0

#define IMXRT_PAD_GPIO_AD_10_USB_OTG1_PWR                      0x400e8134 0x400e8378 0          0x0 0
#define IMXRT_PAD_GPIO_AD_10_LPI2C1_SCLS                       0x400e8134 0x400e8378 0          0x1 0
#define IMXRT_PAD_GPIO_AD_10_EMVSIM2_PD                        0x400e8134 0x400e8378 0x400e86AC 0x2 0
#define IMXRT_PAD_GPIO_AD_10_GPT3_COMPARE3                     0x400e8134 0x400e8378 0          0x3 0
#define IMXRT_PAD_GPIO_AD_10_VIDEO_MUX_CSI_DATA11              0x400e8134 0x400e8378 0          0x4 0
#define IMXRT_PAD_GPIO_AD_10_GPIO_MUX3_IO09                    0x400e8134 0x400e8378 0          0x5 0
#define IMXRT_PAD_GPIO_AD_10_ENET_1588_EVENT3_IN               0x400e8134 0x400e8378 0          0x6 0
#define IMXRT_PAD_GPIO_AD_10_FLEXIO2_D10                       0x400e8134 0x400e8378 0          0x8 0
#define IMXRT_PAD_GPIO_AD_10_GPIO9_IO09                        0x400e8134 0x400e8378 0          0xA 0
#define IMXRT_PAD_GPIO_AD_10_FLEXPWM2_PWM0_X                   0x400e8134 0x400e8378 0          0xB 0

#define IMXRT_PAD_GPIO_AD_11_USB_OTG1_OC                       0x400e8138 0x400e837C 0x400e86BC 0x0 0
#define IMXRT_PAD_GPIO_AD_11_LPI2C1_SDAS                       0x400e8138 0x400e837C 0          0x1 0
#define IMXRT_PAD_GPIO_AD_11_EMVSIM2_POWER_FAIL                0x400e8138 0x400e837C 0x400e86B0 0x2 0
#define IMXRT_PAD_GPIO_AD_11_GPT3_CLK                          0x400e8138 0x400e837C 0x400e8598 0x3 1
#define IMXRT_PAD_GPIO_AD_11_VIDEO_MUX_CSI_DATA10              0x400e8138 0x400e837C 0          0x4 0
#define IMXRT_PAD_GPIO_AD_11_GPIO_MUX3_IO10                    0x400e8138 0x400e837C 0          0x5 0
#define IMXRT_PAD_GPIO_AD_11_ENET_1588_EVENT3_OUT              0x400e8138 0x400e837C 0          0x6 0
#define IMXRT_PAD_GPIO_AD_11_FLEXIO2_D11                       0x400e8138 0x400e837C 0          0x8 0
#define IMXRT_PAD_GPIO_AD_11_GPIO9_IO10                        0x400e8138 0x400e837C 0          0xA 0
#define IMXRT_PAD_GPIO_AD_11_FLEXPWM2_PWM1_X                   0x400e8138 0x400e837C 0          0xB 0

#define IMXRT_PAD_GPIO_AD_12_SPDIF_LOCK                        0x400e813C 0x400e8380 0          0x0 0
#define IMXRT_PAD_GPIO_AD_12_LPI2C1_HREQ                       0x400e813C 0x400e8380 0          0x1 0
#define IMXRT_PAD_GPIO_AD_12_GPT1_CAPTURE1                     0x400e813C 0x400e8380 0          0x2 0
#define IMXRT_PAD_GPIO_AD_12_FLEXSPI1_B_DATA03                 0x400e813C 0x400e8380 0x400e8570 0x3 0
#define IMXRT_PAD_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK              0x400e813C 0x400e8380 0          0x4 0
#define IMXRT_PAD_GPIO_AD_12_GPIO_MUX3_IO11                    0x400e813C 0x400e8380 0          0x5 0
#define IMXRT_PAD_GPIO_AD_12_ENET_TX_DATA03                    0x400e813C 0x400e8380 0          0x6 0
#define IMXRT_PAD_GPIO_AD_12_FLEXIO2_D12                       0x400e813C 0x400e8380 0          0x8 0
#define IMXRT_PAD_GPIO_AD_12_EWM_OUT_B                         0x400e813C 0x400e8380 0          0x9 0
#define IMXRT_PAD_GPIO_AD_12_GPIO9_IO11                        0x400e813C 0x400e8380 0          0xA 0
#define IMXRT_PAD_GPIO_AD_12_FLEXPWM2_PWM2_X                   0x400e813C 0x400e8380 0          0xB 0

#define IMXRT_PAD_GPIO_AD_13_SPDIF_SR_CLK                      0x400e8140 0x400e8384 0          0x0 0
#define IMXRT_PAD_GPIO_AD_13_PIT1_TRIGGER0                     0x400e8140 0x400e8384 0          0x1 0
#define IMXRT_PAD_GPIO_AD_13_GPT1_CAPTURE2                     0x400e8140 0x400e8384 0          0x2 0
#define IMXRT_PAD_GPIO_AD_13_FLEXSPI1_B_DATA02                 0x400e8140 0x400e8384 0x400e856C 0x3 0
#define IMXRT_PAD_GPIO_AD_13_VIDEO_MUX_CSI_MCLK                0x400e8140 0x400e8384 0          0x4 0
#define IMXRT_PAD_GPIO_AD_13_GPIO_MUX3_IO12                    0x400e8140 0x400e8384 0          0x5 0
#define IMXRT_PAD_GPIO_AD_13_ENET_TX_DATA02                    0x400e8140 0x400e8384 0          0x6 0
#define IMXRT_PAD_GPIO_AD_13_FLEXIO2_D13                       0x400e8140 0x400e8384 0          0x8 0
#define IMXRT_PAD_GPIO_AD_13_REF_CLK_32K                       0x400e8140 0x400e8384 0          0x9 0
#define IMXRT_PAD_GPIO_AD_13_GPIO9_IO12                        0x400e8140 0x400e8384 0          0xA 0
#define IMXRT_PAD_GPIO_AD_13_FLEXPWM2_PWM3_X                   0x400e8140 0x400e8384 0          0xB 0

#define IMXRT_PAD_GPIO_AD_14_SPDIF_EXT_CLK                     0x400e8144 0x400e8388 0          0x0 0
#define IMXRT_PAD_GPIO_AD_14_REF_CLK_24M                       0x400e8144 0x400e8388 0          0x1 0
#define IMXRT_PAD_GPIO_AD_14_GPT1_COMPARE1                     0x400e8144 0x400e8388 0          0x2 0
#define IMXRT_PAD_GPIO_AD_14_FLEXSPI1_B_DATA01                 0x400e8144 0x400e8388 0x400e8568 0x3 0
#define IMXRT_PAD_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC               0x400e8144 0x400e8388 0          0x4 0
#define IMXRT_PAD_GPIO_AD_14_GPIO_MUX3_IO13                    0x400e8144 0x400e8388 0          0x5 0
#define IMXRT_PAD_GPIO_AD_14_ENET_RX_CLK                       0x400e8144 0x400e8388 0          0x6 0
#define IMXRT_PAD_GPIO_AD_14_FLEXIO2_D14                       0x400e8144 0x400e8388 0          0x8 0
#define IMXRT_PAD_GPIO_AD_14_CCM_ENET_REF_CLK_25M              0x400e8144 0x400e8388 0          0x9 0
#define IMXRT_PAD_GPIO_AD_14_GPIO9_IO13                        0x400e8144 0x400e8388 0          0xA 0
#define IMXRT_PAD_GPIO_AD_14_FLEXPWM3_PWM0_X                   0x400e8144 0x400e8388 0          0xB 0

#define IMXRT_PAD_GPIO_AD_15_GPIO9_IO14                        0x400e8148 0x400e838C 0          0xA 0
#define IMXRT_PAD_GPIO_AD_15_FLEXPWM3_PWM1_X                   0x400e8148 0x400e838C 0          0xB 0
#define IMXRT_PAD_GPIO_AD_15_SPDIF_IN                          0x400e8148 0x400e838C 0x400e86B4 0x0 1
#define IMXRT_PAD_GPIO_AD_15_LPUART10_TXD                      0x400e8148 0x400e838C 0x400e8628 0x1 0
#define IMXRT_PAD_GPIO_AD_15_GPT1_COMPARE2                     0x400e8148 0x400e838C 0          0x2 0
#define IMXRT_PAD_GPIO_AD_15_FLEXSPI1_B_DATA00                 0x400e8148 0x400e838C 0x400e8564 0x3 0
#define IMXRT_PAD_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC               0x400e8148 0x400e838C 0          0x4 0
#define IMXRT_PAD_GPIO_AD_15_GPIO_MUX3_IO14                    0x400e8148 0x400e838C 0          0x5 0
#define IMXRT_PAD_GPIO_AD_15_ENET_TX_ER                        0x400e8148 0x400e838C 0          0x6 0
#define IMXRT_PAD_GPIO_AD_15_FLEXIO2_D15                       0x400e8148 0x400e838C 0          0x8 0

