RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_AD_16_SPDIF_OUT                         0x400e814C 0x400e8390 0          0x0 0
#define IMXRT_PAD_GPIO_AD_16_LPUART10_RXD                      0x400e814C 0x400e8390 0x400e8624 0x1 0
#define IMXRT_PAD_GPIO_AD_16_GPT1_COMPARE3                     0x400e814C 0x400e8390 0          0x2 0
#define IMXRT_PAD_GPIO_AD_16_FLEXSPI1_B_SCLK                   0x400e814C 0x400e8390 0x400e8578 0x3 0
#define IMXRT_PAD_GPIO_AD_16_VIDEO_MUX_CSI_DATA09              0x400e814C 0x400e8390 0          0x4 0
#define IMXRT_PAD_GPIO_AD_16_GPIO_MUX3_IO15                    0x400e814C 0x400e8390 0          0x5 0
#define IMXRT_PAD_GPIO_AD_16_ENET_RX_DATA03                    0x400e814C 0x400e8390 0          0x6 0
#define IMXRT_PAD_GPIO_AD_16_FLEXIO2_D16                       0x400e814C 0x400e8390 0          0x8 0
#define IMXRT_PAD_GPIO_AD_16_ENET_1G_MDC                       0x400e814C 0x400e8390 0          0x9 0
#define IMXRT_PAD_GPIO_AD_16_GPIO9_IO15                        0x400e814C 0x400e8390 0          0xA 0
#define IMXRT_PAD_GPIO_AD_16_FLEXPWM3_PWM2_X                   0x400e814C 0x400e8390 0          0xB 0

#define IMXRT_PAD_GPIO_AD_17_SAI1_MCLK                         0x400e8150 0x400e8394 0x400e866C 0x0 0
#define IMXRT_PAD_GPIO_AD_17_ACMP1_OUT                         0x400e8150 0x400e8394 0          0x1 0
#define IMXRT_PAD_GPIO_AD_17_GPT1_CLK                          0x400e8150 0x400e8394 0          0x2 0
#define IMXRT_PAD_GPIO_AD_17_FLEXSPI1_A_DQS                    0x400e8150 0x400e8394 0x400e8550 0x3 1
#define IMXRT_PAD_GPIO_AD_17_VIDEO_MUX_CSI_DATA08              0x400e8150 0x400e8394 0          0x4 0
#define IMXRT_PAD_GPIO_AD_17_GPIO_MUX3_IO16                    0x400e8150 0x400e8394 0          0x5 0
#define IMXRT_PAD_GPIO_AD_17_ENET_RX_DATA02                    0x400e8150 0x400e8394 0          0x6 0
#define IMXRT_PAD_GPIO_AD_17_FLEXIO2_D17                       0x400e8150 0x400e8394 0          0x8 0
#define IMXRT_PAD_GPIO_AD_17_ENET_1G_MDIO                      0x400e8150 0x400e8394 0x400e84C8 0x9 2
#define IMXRT_PAD_GPIO_AD_17_GPIO9_IO16                        0x400e8150 0x400e8394 0          0xA 0
#define IMXRT_PAD_GPIO_AD_17_FLEXPWM3_PWM3_X                   0x400e8150 0x400e8394 0          0xB 0

#define IMXRT_PAD_GPIO_AD_18_GPIO9_IO17                        0x400e8154 0x400e8398 0          0xA 0
#define IMXRT_PAD_GPIO_AD_18_FLEXPWM4_PWM0_X                   0x400e8154 0x400e8398 0          0xB 0
#define IMXRT_PAD_GPIO_AD_18_SAI1_RX_SYNC                      0x400e8154 0x400e8398 0x400e8678 0x0 0
#define IMXRT_PAD_GPIO_AD_18_ACMP2_OUT                         0x400e8154 0x400e8398 0          0x1 0
#define IMXRT_PAD_GPIO_AD_18_LPSPI1_PCS1                       0x400e8154 0x400e8398 0          0x2 0
#define IMXRT_PAD_GPIO_AD_18_FLEXSPI1_A_SS0_B                  0x400e8154 0x400e8398 0          0x3 0
#define IMXRT_PAD_GPIO_AD_18_VIDEO_MUX_CSI_DATA07              0x400e8154 0x400e8398 0          0x4 0
#define IMXRT_PAD_GPIO_AD_18_GPIO_MUX3_IO17                    0x400e8154 0x400e8398 0          0x5 0
#define IMXRT_PAD_GPIO_AD_18_ENET_CRS                          0x400e8154 0x400e8398 0          0x6 0
#define IMXRT_PAD_GPIO_AD_18_FLEXIO2_D18                       0x400e8154 0x400e8398 0          0x8 0
#define IMXRT_PAD_GPIO_AD_18_LPI2C2_SCL                        0x400e8154 0x400e8398 0x400e85B4 0x9 1

#define IMXRT_PAD_GPIO_AD_19_SAI1_RX_BCLK                      0x400e8158 0x400e839C 0x400e8670 0x0 0
#define IMXRT_PAD_GPIO_AD_19_ACMP3_OUT                         0x400e8158 0x400e839C 0          0x1 0
#define IMXRT_PAD_GPIO_AD_19_LPSPI1_PCS2                       0x400e8158 0x400e839C 0          0x2 0
#define IMXRT_PAD_GPIO_AD_19_FLEXSPI1_A_SCLK                   0x400e8158 0x400e839C 0x400e8574 0x3 0
#define IMXRT_PAD_GPIO_AD_19_VIDEO_MUX_CSI_DATA06              0x400e8158 0x400e839C 0          0x4 0
#define IMXRT_PAD_GPIO_AD_19_GPIO_MUX3_IO18                    0x400e8158 0x400e839C 0          0x5 0
#define IMXRT_PAD_GPIO_AD_19_ENET_COL                          0x400e8158 0x400e839C 0          0x6 0
#define IMXRT_PAD_GPIO_AD_19_FLEXIO2_D19                       0x400e8158 0x400e839C 0          0x8 0
#define IMXRT_PAD_GPIO_AD_19_LPI2C2_SDA                        0x400e8158 0x400e839C 0x400e85B8 0x9 1
#define IMXRT_PAD_GPIO_AD_19_GPIO9_IO18                        0x400e8158 0x400e839C 0          0xA 0
#define IMXRT_PAD_GPIO_AD_19_FLEXPWM4_PWM1_X                   0x400e8158 0x400e839C 0          0xB 0

#define IMXRT_PAD_GPIO_AD_20_SAI1_RX_DATA00                    0x400e815C 0x400e83A0 0x400e8674 0x0 0
#define IMXRT_PAD_GPIO_AD_20_ACMP4_OUT                         0x400e815C 0x400e83A0 0          0x1 0
#define IMXRT_PAD_GPIO_AD_20_LPSPI1_PCS3                       0x400e815C 0x400e83A0 0          0x2 0
#define IMXRT_PAD_GPIO_AD_20_FLEXSPI1_A_DATA00                 0x400e815C 0x400e83A0 0x400e8554 0x3 0
#define IMXRT_PAD_GPIO_AD_20_VIDEO_MUX_CSI_DATA05              0x400e815C 0x400e83A0 0          0x4 0
#define IMXRT_PAD_GPIO_AD_20_GPIO_MUX3_IO19                    0x400e815C 0x400e83A0 0          0x5 0
#define IMXRT_PAD_GPIO_AD_20_KPP_ROW07                         0x400e815C 0x400e83A0 0x400e85A8 0x6 0
#define IMXRT_PAD_GPIO_AD_20_FLEXIO2_D20                       0x400e815C 0x400e83A0 0          0x8 0
#define IMXRT_PAD_GPIO_AD_20_ENET_QOS_1588_EVENT2_OUT          0x400e815C 0x400e83A0 0          0x9 0
#define IMXRT_PAD_GPIO_AD_20_GPIO9_IO19                        0x400e815C 0x400e83A0 0          0xA 0
#define IMXRT_PAD_GPIO_AD_20_FLEXPWM4_PWM2_X                   0x400e815C 0x400e83A0 0          0xB 0

#define IMXRT_PAD_GPIO_AD_21_SAI1_TX_DATA00                    0x400e8160 0x400e83A4 0          0x0 0
#define IMXRT_PAD_GPIO_AD_21_LPSPI2_PCS1                       0x400e8160 0x400e83A4 0x400e85E0 0x2 0
#define IMXRT_PAD_GPIO_AD_21_FLEXSPI1_A_DATA01                 0x400e8160 0x400e83A4 0x400e8558 0x3 0
#define IMXRT_PAD_GPIO_AD_21_VIDEO_MUX_CSI_DATA04              0x400e8160 0x400e83A4 0          0x4 0
#define IMXRT_PAD_GPIO_AD_21_GPIO_MUX3_IO20                    0x400e8160 0x400e83A4 0          0x5 0
#define IMXRT_PAD_GPIO_AD_21_KPP_COL07                         0x400e8160 0x400e83A4 0x400e85A0 0x6 0
#define IMXRT_PAD_GPIO_AD_21_FLEXIO2_D21                       0x400e8160 0x400e83A4 0          0x8 0
#define IMXRT_PAD_GPIO_AD_21_ENET_QOS_1588_EVENT2_IN           0x400e8160 0x400e83A4 0          0x9 0
#define IMXRT_PAD_GPIO_AD_21_GPIO9_IO20                        0x400e8160 0x400e83A4 0          0xA 0
#define IMXRT_PAD_GPIO_AD_21_FLEXPWM4_PWM3_X                   0x400e8160 0x400e83A4 0          0xB 0

