RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_AD_22_GPIO9_IO21                        0x400e8164 0x400e83A8 0          0xA 0
#define IMXRT_PAD_GPIO_AD_22_SAI1_TX_BCLK                      0x400e8164 0x400e83A8 0x400e867C 0x0 0
#define IMXRT_PAD_GPIO_AD_22_LPSPI2_PCS2                       0x400e8164 0x400e83A8 0          0x2 0
#define IMXRT_PAD_GPIO_AD_22_FLEXSPI1_A_DATA02                 0x400e8164 0x400e83A8 0x400e855C 0x3 0
#define IMXRT_PAD_GPIO_AD_22_VIDEO_MUX_CSI_DATA03              0x400e8164 0x400e83A8 0          0x4 0
#define IMXRT_PAD_GPIO_AD_22_GPIO_MUX3_IO21                    0x400e8164 0x400e83A8 0          0x5 0
#define IMXRT_PAD_GPIO_AD_22_KPP_ROW06                         0x400e8164 0x400e83A8 0x400e85A4 0x6 0
#define IMXRT_PAD_GPIO_AD_22_FLEXIO2_D22                       0x400e8164 0x400e83A8 0          0x8 0
#define IMXRT_PAD_GPIO_AD_22_ENET_QOS_1588_EVENT3_OUT          0x400e8164 0x400e83A8 0          0x9 0

#define IMXRT_PAD_GPIO_AD_23_SAI1_TX_SYNC                      0x400e8168 0x400e83AC 0x400e8680 0x0 0
#define IMXRT_PAD_GPIO_AD_23_LPSPI2_PCS3                       0x400e8168 0x400e83AC 0          0x2 0
#define IMXRT_PAD_GPIO_AD_23_FLEXSPI1_A_DATA03                 0x400e8168 0x400e83AC 0x400e8560 0x3 0
#define IMXRT_PAD_GPIO_AD_23_VIDEO_MUX_CSI_DATA02              0x400e8168 0x400e83AC 0          0x4 0
#define IMXRT_PAD_GPIO_AD_23_GPIO_MUX3_IO22                    0x400e8168 0x400e83AC 0          0x5 0
#define IMXRT_PAD_GPIO_AD_23_KPP_COL06                         0x400e8168 0x400e83AC 0x400e859C 0x6 0
#define IMXRT_PAD_GPIO_AD_23_FLEXIO2_D23                       0x400e8168 0x400e83AC 0          0x8 0
#define IMXRT_PAD_GPIO_AD_23_ENET_QOS_1588_EVENT3_IN           0x400e8168 0x400e83AC 0          0x9 0
#define IMXRT_PAD_GPIO_AD_23_GPIO9_IO22                        0x400e8168 0x400e83AC 0          0xA 0

#define IMXRT_PAD_GPIO_AD_24_LPUART1_TXD                       0x400e816C 0x400e83B0 0x400e8620 0x0 0
#define IMXRT_PAD_GPIO_AD_24_LPSPI2_SCK                        0x400e816C 0x400e83B0 0x400e85E4 0x1 0
#define IMXRT_PAD_GPIO_AD_24_VIDEO_MUX_CSI_DATA00              0x400e816C 0x400e83B0 0          0x2 0
#define IMXRT_PAD_GPIO_AD_24_ENET_RX_EN                        0x400e816C 0x400e83B0 0x400e84B8 0x3 0
#define IMXRT_PAD_GPIO_AD_24_FLEXPWM2_PWM0_A                   0x400e816C 0x400e83B0 0x400e8518 0x4 1
#define IMXRT_PAD_GPIO_AD_24_GPIO_MUX3_IO23                    0x400e816C 0x400e83B0 0          0x5 0
#define IMXRT_PAD_GPIO_AD_24_KPP_ROW05                         0x400e816C 0x400e83B0 0          0x6 0
#define IMXRT_PAD_GPIO_AD_24_FLEXIO2_D24                       0x400e816C 0x400e83B0 0          0x8 0
#define IMXRT_PAD_GPIO_AD_24_LPI2C4_SCL                        0x400e816C 0x400e83B0 0x400e85C4 0x9 0
#define IMXRT_PAD_GPIO_AD_24_GPIO9_IO23                        0x400e816C 0x400e83B0 0          0xA 0

#define IMXRT_PAD_GPIO_AD_25_GPIO9_IO24                        0x400e8170 0x400e83B4 0          0xA 0
#define IMXRT_PAD_GPIO_AD_25_LPUART1_RXD                       0x400e8170 0x400e83B4 0x400e861C 0x0 0
#define IMXRT_PAD_GPIO_AD_25_LPSPI2_PCS0                       0x400e8170 0x400e83B4 0x400e85DC 0x1 0
#define IMXRT_PAD_GPIO_AD_25_VIDEO_MUX_CSI_DATA01              0x400e8170 0x400e83B4 0          0x2 0
#define IMXRT_PAD_GPIO_AD_25_ENET_RX_ER                        0x400e8170 0x400e83B4 0x400e84BC 0x3 0
#define IMXRT_PAD_GPIO_AD_25_FLEXPWM2_PWM0_B                   0x400e8170 0x400e83B4 0x400e8524 0x4 1
#define IMXRT_PAD_GPIO_AD_25_GPIO_MUX3_IO24                    0x400e8170 0x400e83B4 0          0x5 0
#define IMXRT_PAD_GPIO_AD_25_KPP_COL05                         0x400e8170 0x400e83B4 0          0x6 0
#define IMXRT_PAD_GPIO_AD_25_FLEXIO2_D25                       0x400e8170 0x400e83B4 0          0x8 0
#define IMXRT_PAD_GPIO_AD_25_LPI2C4_SDA                        0x400e8170 0x400e83B4 0x400e85C8 0x9 0

#define IMXRT_PAD_GPIO_AD_26_LPUART1_CTS_B                     0x400e8174 0x400e83B8 0          0x0 0
#define IMXRT_PAD_GPIO_AD_26_LPSPI2_SOUT                       0x400e8174 0x400e83B8 0x400e85EC 0x1 0
#define IMXRT_PAD_GPIO_AD_26_SEMC_CSX01                        0x400e8174 0x400e83B8 0          0x2 0
#define IMXRT_PAD_GPIO_AD_26_ENET_RX_DATA00                    0x400e8174 0x400e83B8 0x400e84B0 0x3 0
#define IMXRT_PAD_GPIO_AD_26_FLEXPWM2_PWM1_A                   0x400e8174 0x400e83B8 0x400e851C 0x4 1
#define IMXRT_PAD_GPIO_AD_26_GPIO_MUX3_IO25                    0x400e8174 0x400e83B8 0          0x5 0
#define IMXRT_PAD_GPIO_AD_26_KPP_ROW04                         0x400e8174 0x400e83B8 0          0x6 0
#define IMXRT_PAD_GPIO_AD_26_FLEXIO2_D26                       0x400e8174 0x400e83B8 0          0x8 0
#define IMXRT_PAD_GPIO_AD_26_ENET_QOS_MDC                      0x400e8174 0x400e83B8 0          0x9 0
#define IMXRT_PAD_GPIO_AD_26_GPIO9_IO25                        0x400e8174 0x400e83B8 0          0xA 0
#define IMXRT_PAD_GPIO_AD_26_USDHC2_CD_B                       0x400e8174 0x400e83B8 0x400e86D0 0xB 1

#define IMXRT_PAD_GPIO_AD_27_LPUART1_RTS_B                     0x400e8178 0x400e83BC 0          0x0 0
#define IMXRT_PAD_GPIO_AD_27_LPSPI2_SIN                        0x400e8178 0x400e83BC 0x400e85E8 0x1 0
#define IMXRT_PAD_GPIO_AD_27_SEMC_CSX02                        0x400e8178 0x400e83BC 0          0x2 0
#define IMXRT_PAD_GPIO_AD_27_ENET_RX_DATA01                    0x400e8178 0x400e83BC 0x400e84B4 0x3 0
#define IMXRT_PAD_GPIO_AD_27_FLEXPWM2_PWM1_B                   0x400e8178 0x400e83BC 0x400e8528 0x4 1
#define IMXRT_PAD_GPIO_AD_27_GPIO_MUX3_IO26                    0x400e8178 0x400e83BC 0          0x5 0
#define IMXRT_PAD_GPIO_AD_27_KPP_COL04                         0x400e8178 0x400e83BC 0          0x6 0
#define IMXRT_PAD_GPIO_AD_27_FLEXIO2_D27                       0x400e8178 0x400e83BC 0          0x8 0
#define IMXRT_PAD_GPIO_AD_27_ENET_QOS_MDIO                     0x400e8178 0x400e83BC 0x400e84EC 0x9 1
#define IMXRT_PAD_GPIO_AD_27_GPIO9_IO26                        0x400e8178 0x400e83BC 0          0xA 0
#define IMXRT_PAD_GPIO_AD_27_USDHC2_WP                         0x400e8178 0x400e83BC 0x400e86D4 0xB 1

#define IMXRT_PAD_GPIO_AD_28_GPIO9_IO27                        0x400e817C 0x400e83C0 0          0xA 0
#define IMXRT_PAD_GPIO_AD_28_USDHC2_VSELECT                    0x400e817C 0x400e83C0 0          0xB 0
#define IMXRT_PAD_GPIO_AD_28_LPSPI1_SCK                        0x400e817C 0x400e83C0 0x400e85D0 0x0 1
#define IMXRT_PAD_GPIO_AD_28_LPUART5_TXD                       0x400e817C 0x400e83C0 0          0x1 0
#define IMXRT_PAD_GPIO_AD_28_SEMC_CSX03                        0x400e817C 0x400e83C0 0          0x2 0
#define IMXRT_PAD_GPIO_AD_28_ENET_TX_EN                        0x400e817C 0x400e83C0 0          0x3 0
#define IMXRT_PAD_GPIO_AD_28_FLEXPWM2_PWM2_A                   0x400e817C 0x400e83C0 0x400e8520 0x4 1
#define IMXRT_PAD_GPIO_AD_28_GPIO_MUX3_IO27                    0x400e817C 0x400e83C0 0          0x5 0
#define IMXRT_PAD_GPIO_AD_28_KPP_ROW03                         0x400e817C 0x400e83C0 0          0x6 0
#define IMXRT_PAD_GPIO_AD_28_FLEXIO2_D28                       0x400e817C 0x400e83C0 0          0x8 0
#define IMXRT_PAD_GPIO_AD_28_VIDEO_MUX_EXT_DCIC1               0x400e817C 0x400e83C0 0          0x9 0

#define IMXRT_PAD_GPIO_AD_29_LPSPI1_PCS0                       0x400e8180 0x400e83C4 0x400e85CC 0x0 1
#define IMXRT_PAD_GPIO_AD_29_LPUART5_RXD                       0x400e8180 0x400e83C4 0          0x1 0
#define IMXRT_PAD_GPIO_AD_29_ENET_REF_CLK                      0x400e8180 0x400e83C4 0x400e84A8 0x2 0
#define IMXRT_PAD_GPIO_AD_29_ENET_TX_CLK                       0x400e8180 0x400e83C4 0x400e84C0 0x3 0
#define IMXRT_PAD_GPIO_AD_29_FLEXPWM2_PWM2_B                   0x400e8180 0x400e83C4 0x400e852C 0x4 1
#define IMXRT_PAD_GPIO_AD_29_GPIO_MUX3_IO28                    0x400e8180 0x400e83C4 0          0x5 0
#define IMXRT_PAD_GPIO_AD_29_KPP_COL03                         0x400e8180 0x400e83C4 0          0x6 0
#define IMXRT_PAD_GPIO_AD_29_FLEXIO2_D29                       0x400e8180 0x400e83C4 0          0x8 0
#define IMXRT_PAD_GPIO_AD_29_VIDEO_MUX_EXT_DCIC2               0x400e8180 0x400e83C4 0          0x9 0
#define IMXRT_PAD_GPIO_AD_29_GPIO9_IO28                        0x400e8180 0x400e83C4 0          0xA 0
#define IMXRT_PAD_GPIO_AD_29_USDHC2_RESET_B                    0x400e8180 0x400e83C4 0          0xB 0

#define IMXRT_PAD_GPIO_AD_30_LPSPI1_SOUT                       0x400e8184 0x400e83C8 0x400e85D8 0x0 1
#define IMXRT_PAD_GPIO_AD_30_USB_OTG2_OC                       0x400e8184 0x400e83C8 0x400e86B8 0x1 1
#define IMXRT_PAD_GPIO_AD_30_FLEXCAN2_TX                       0x400e8184 0x400e83C8 0          0x2 0
#define IMXRT_PAD_GPIO_AD_30_ENET_TX_DATA00                    0x400e8184 0x400e83C8 0          0x3 0
#define IMXRT_PAD_GPIO_AD_30_LPUART3_TXD                       0x400e8184 0x400e83C8 0          0x4 0
#define IMXRT_PAD_GPIO_AD_30_GPIO_MUX3_IO29                    0x400e8184 0x400e83C8 0          0x5 0
#define IMXRT_PAD_GPIO_AD_30_KPP_ROW02                         0x400e8184 0x400e83C8 0          0x6 0
#define IMXRT_PAD_GPIO_AD_30_FLEXIO2_D30                       0x400e8184 0x400e83C8 0          0x8 0
#define IMXRT_PAD_GPIO_AD_30_WDOG2_RESET_B_DEB                 0x400e8184 0x400e83C8 0          0x9 0
#define IMXRT_PAD_GPIO_AD_30_GPIO9_IO29                        0x400e8184 0x400e83C8 0          0xA 0

#define IMXRT_PAD_GPIO_AD_31_LPSPI1_SIN                        0x400e8188 0x400e83CC 0x400e85D4 0x0 1
#define IMXRT_PAD_GPIO_AD_31_USB_OTG2_PWR                      0x400e8188 0x400e83CC 0          0x1 0
#define IMXRT_PAD_GPIO_AD_31_FLEXCAN2_RX                       0x400e8188 0x400e83CC 0x400e849C 0x2 1
#define IMXRT_PAD_GPIO_AD_31_ENET_TX_DATA01                    0x400e8188 0x400e83CC 0          0x3 0
#define IMXRT_PAD_GPIO_AD_31_LPUART3_RXD                       0x400e8188 0x400e83CC 0          0x4 0
#define IMXRT_PAD_GPIO_AD_31_GPIO_MUX3_IO30                    0x400e8188 0x400e83CC 0          0x5 0
#define IMXRT_PAD_GPIO_AD_31_KPP_COL02                         0x400e8188 0x400e83CC 0          0x6 0
#define IMXRT_PAD_GPIO_AD_31_FLEXIO2_D31                       0x400e8188 0x400e83CC 0          0x8 0
#define IMXRT_PAD_GPIO_AD_31_WDOG1_RESET_B_DEB                 0x400e8188 0x400e83CC 0          0x9 0
#define IMXRT_PAD_GPIO_AD_31_GPIO9_IO30                        0x400e8188 0x400e83CC 0          0xA 0

#define IMXRT_PAD_GPIO_AD_32_GPIO9_IO31                        0x400e818C 0x400e83D0 0          0xA 0
#define IMXRT_PAD_GPIO_AD_32_LPI2C1_SCL                        0x400e818C 0x400e83D0 0x400e85AC 0x0 1
#define IMXRT_PAD_GPIO_AD_32_USBPHY2_OTG_ID                    0x400e818C 0x400e83D0 0x400e86C4 0x1 1
#define IMXRT_PAD_GPIO_AD_32_PGMC_PMIC_RDY                     0x400e818C 0x400e83D0 0          0x2 0
#define IMXRT_PAD_GPIO_AD_32_ENET_MDC                          0x400e818C 0x400e83D0 0          0x3 0
#define IMXRT_PAD_GPIO_AD_32_USDHC1_CD_B                       0x400e818C 0x400e83D0 0x400e86C8 0x4 0
#define IMXRT_PAD_GPIO_AD_32_GPIO_MUX3_IO31                    0x400e818C 0x400e83D0 0          0x5 0
#define IMXRT_PAD_GPIO_AD_32_KPP_ROW01                         0x400e818C 0x400e83D0 0          0x6 0
#define IMXRT_PAD_GPIO_AD_32_LPUART10_TXD                      0x400e818C 0x400e83D0 0x400e8628 0x8 1
#define IMXRT_PAD_GPIO_AD_32_ENET_1G_MDC                       0x400e818C 0x400e83D0 0          0x9 0

