RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_AD_33_LPI2C1_SDA                        0x400e8190 0x400e83D4 0x400e85B0 0x0 1
#define IMXRT_PAD_GPIO_AD_33_USBPHY1_OTG_ID                    0x400e8190 0x400e83D4 0x400e86C0 0x1 1
#define IMXRT_PAD_GPIO_AD_33_XBAR1_INOUT17                     0x400e8190 0x400e83D4 0          0x2 0
#define IMXRT_PAD_GPIO_AD_33_ENET_MDIO                         0x400e8190 0x400e83D4 0x400e84AC 0x3 1
#define IMXRT_PAD_GPIO_AD_33_USDHC1_WP                         0x400e8190 0x400e83D4 0x400e86CC 0x4 0
#define IMXRT_PAD_GPIO_AD_33_GPIO_MUX4_IO00                    0x400e8190 0x400e83D4 0          0x5 0
#define IMXRT_PAD_GPIO_AD_33_KPP_COL01                         0x400e8190 0x400e83D4 0          0x6 0
#define IMXRT_PAD_GPIO_AD_33_LPUART10_RXD                      0x400e8190 0x400e83D4 0x400e8624 0x8 1
#define IMXRT_PAD_GPIO_AD_33_ENET_1G_MDIO                      0x400e8190 0x400e83D4 0x400e84C8 0x9 3
#define IMXRT_PAD_GPIO_AD_33_GPIO10_IO00                       0x400e8190 0x400e83D4 0          0xA 0

#define IMXRT_PAD_GPIO_AD_34_ENET_1G_1588_EVENT0_IN            0x400e8194 0x400e83D8 0          0x0 0
#define IMXRT_PAD_GPIO_AD_34_USB_OTG1_PWR                      0x400e8194 0x400e83D8 0          0x1 0
#define IMXRT_PAD_GPIO_AD_34_XBAR1_INOUT18                     0x400e8194 0x400e83D8 0          0x2 0
#define IMXRT_PAD_GPIO_AD_34_ENET_1588_EVENT0_IN               0x400e8194 0x400e83D8 0          0x3 0
#define IMXRT_PAD_GPIO_AD_34_USDHC1_VSELECT                    0x400e8194 0x400e83D8 0          0x4 0
#define IMXRT_PAD_GPIO_AD_34_GPIO_MUX4_IO01                    0x400e8194 0x400e83D8 0          0x5 0
#define IMXRT_PAD_GPIO_AD_34_KPP_ROW00                         0x400e8194 0x400e83D8 0          0x6 0
#define IMXRT_PAD_GPIO_AD_34_LPUART10_CTS_B                    0x400e8194 0x400e83D8 0          0x8 0
#define IMXRT_PAD_GPIO_AD_34_WDOG1_ANY                         0x400e8194 0x400e83D8 0          0x9 0
#define IMXRT_PAD_GPIO_AD_34_GPIO10_IO01                       0x400e8194 0x400e83D8 0          0xA 0

#define IMXRT_PAD_GPIO_AD_35_GPIO10_IO02                       0x400e8198 0x400e83DC 0          0xA 0
#define IMXRT_PAD_GPIO_AD_35_ENET_1G_1588_EVENT0_OUT           0x400e8198 0x400e83DC 0          0x0 0
#define IMXRT_PAD_GPIO_AD_35_USB_OTG1_OC                       0x400e8198 0x400e83DC 0x400e86BC 0x1 1
#define IMXRT_PAD_GPIO_AD_35_XBAR1_INOUT19                     0x400e8198 0x400e83DC 0          0x2 0
#define IMXRT_PAD_GPIO_AD_35_ENET_1588_EVENT0_OUT              0x400e8198 0x400e83DC 0          0x3 0
#define IMXRT_PAD_GPIO_AD_35_USDHC1_RESET_B                    0x400e8198 0x400e83DC 0          0x4 0
#define IMXRT_PAD_GPIO_AD_35_GPIO_MUX4_IO02                    0x400e8198 0x400e83DC 0          0x5 0
#define IMXRT_PAD_GPIO_AD_35_KPP_COL00                         0x400e8198 0x400e83DC 0          0x6 0
#define IMXRT_PAD_GPIO_AD_35_LPUART10_RTS_B                    0x400e8198 0x400e83DC 0          0x8 0
#define IMXRT_PAD_GPIO_AD_35_FLEXSPI1_B_SS1_B                  0x400e8198 0x400e83DC 0          0x9 0

#define IMXRT_PAD_GPIO_SD_B1_00_USDHC1_CMD                     0x400e819C 0x400e83E0 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B1_00_XBAR1_INOUT20                  0x400e819C 0x400e83E0 0x400e86D8 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_00_GPT4_CAPTURE1                  0x400e819C 0x400e83E0 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B1_00_GPIO_MUX4_IO03                 0x400e819C 0x400e83E0 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B1_00_FLEXSPI2_A_SS0_B               0x400e819C 0x400e83E0 0          0x6 0
#define IMXRT_PAD_GPIO_SD_B1_00_KPP_ROW07                      0x400e819C 0x400e83E0 0x400e85A8 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_00_GPIO10_IO03                    0x400e819C 0x400e83E0 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B1_01_USDHC1_CLK                     0x400e81A0 0x400e83E4 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B1_01_XBAR1_INOUT21                  0x400e81A0 0x400e83E4 0x400e86DC 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_01_GPT4_CAPTURE2                  0x400e81A0 0x400e83E4 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B1_01_GPIO_MUX4_IO04                 0x400e81A0 0x400e83E4 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B1_01_FLEXSPI2_A_SCLK                0x400e81A0 0x400e83E4 0x400e858C 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_01_KPP_COL07                      0x400e81A0 0x400e83E4 0x400e85A0 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_01_GPIO10_IO04                    0x400e81A0 0x400e83E4 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B1_02_GPIO10_IO05                    0x400e81A4 0x400e83E8 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B1_02_USDHC1_DATA0                   0x400e81A4 0x400e83E8 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B1_02_XBAR1_INOUT22                  0x400e81A4 0x400e83E8 0x400e86E0 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_02_GPT4_COMPARE1                  0x400e81A4 0x400e83E8 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B1_02_GPIO_MUX4_IO05                 0x400e81A4 0x400e83E8 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B1_02_FLEXSPI2_A_DATA00              0x400e81A4 0x400e83E8 0x400e857C 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_02_KPP_ROW06                      0x400e81A4 0x400e83E8 0x400e85A4 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_02_FLEXSPI1_A_SS1_B               0x400e81A4 0x400e83E8 0          0x9 0

#define IMXRT_PAD_GPIO_SD_B1_03_USDHC1_DATA1                   0x400e81A8 0x400e83EC 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B1_03_XBAR1_INOUT23                  0x400e81A8 0x400e83EC 0x400e86E4 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_03_GPT4_COMPARE2                  0x400e81A8 0x400e83EC 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B1_03_GPIO_MUX4_IO06                 0x400e81A8 0x400e83EC 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B1_03_FLEXSPI2_A_DATA01              0x400e81A8 0x400e83EC 0x400e8580 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_03_KPP_COL06                      0x400e81A8 0x400e83EC 0x400e859C 0x8 1
#define IMXRT_PAD_GPIO_SD_B1_03_FLEXSPI1_B_SS1_B               0x400e81A8 0x400e83EC 0          0x9 0
#define IMXRT_PAD_GPIO_SD_B1_03_GPIO10_IO06                    0x400e81A8 0x400e83EC 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B1_04_USDHC1_DATA2                   0x400e81AC 0x400e83F0 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B1_04_XBAR1_INOUT24                  0x400e81AC 0x400e83F0 0x400e86E8 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_04_GPT4_COMPARE3                  0x400e81AC 0x400e83F0 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B1_04_GPIO_MUX4_IO07                 0x400e81AC 0x400e83F0 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B1_04_FLEXSPI2_A_DATA02              0x400e81AC 0x400e83F0 0x400e8584 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_04_FLEXSPI1_B_SS0_B               0x400e81AC 0x400e83F0 0          0x8 0
#define IMXRT_PAD_GPIO_SD_B1_04_ENET_QOS_1588_EVENT2_AUX_IN    0x400e81AC 0x400e83F0 0          0x9 0
#define IMXRT_PAD_GPIO_SD_B1_04_GPIO10_IO07                    0x400e81AC 0x400e83F0 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B1_05_GPIO10_IO08                    0x400e81B0 0x400e83F4 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B1_05_USDHC1_DATA3                   0x400e81B0 0x400e83F4 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B1_05_XBAR1_INOUT25                  0x400e81B0 0x400e83F4 0x400e86EC 0x2 1
#define IMXRT_PAD_GPIO_SD_B1_05_GPT4_CLK                       0x400e81B0 0x400e83F4 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B1_05_GPIO_MUX4_IO08                 0x400e81B0 0x400e83F4 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B1_05_FLEXSPI2_A_DATA03              0x400e81B0 0x400e83F4 0x400e8588 0x6 1
#define IMXRT_PAD_GPIO_SD_B1_05_FLEXSPI1_B_DQS                 0x400e81B0 0x400e83F4 0          0x8 0
#define IMXRT_PAD_GPIO_SD_B1_05_ENET_QOS_1588_EVENT3_AUX_IN    0x400e81B0 0x400e83F4 0          0x9 0

#define IMXRT_PAD_GPIO_SD_B2_00_GPIO10_IO09                    0x400e81B4 0x400e83F8 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_00_USDHC2_DATA3                   0x400e81B4 0x400e83F8 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_00_FLEXSPI1_B_DATA03              0x400e81B4 0x400e83F8 0x400e8570 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_00_ENET_1G_RX_EN                  0x400e81B4 0x400e83F8 0x400e84E0 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_00_LPUART9_TXD                    0x400e81B4 0x400e83F8 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_00_LPSPI4_SCK                     0x400e81B4 0x400e83F8 0x400e8610 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_00_GPIO_MUX4_IO09                 0x400e81B4 0x400e83F8 0          0x5 0

#define IMXRT_PAD_GPIO_SD_B2_01_USDHC2_DATA2                   0x400e81B8 0x400e83FC 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_01_FLEXSPI1_B_DATA02              0x400e81B8 0x400e83FC 0x400e856C 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_01_ENET_1G_RX_CLK                 0x400e81B8 0x400e83FC 0x400e84CC 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_01_LPUART9_RXD                    0x400e81B8 0x400e83FC 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_01_LPSPI4_PCS0                    0x400e81B8 0x400e83FC 0x400e860C 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_01_GPIO_MUX4_IO10                 0x400e81B8 0x400e83FC 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_01_GPIO10_IO10                    0x400e81B8 0x400e83FC 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B2_02_GPIO10_IO11                    0x400e81BC 0x400e8400 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_02_USDHC2_DATA1                   0x400e81BC 0x400e8400 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_02_FLEXSPI1_B_DATA01              0x400e81BC 0x400e8400 0x400e8568 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_02_ENET_1G_RX_DATA00              0x400e81BC 0x400e8400 0x400e84D0 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_02_LPUART9_CTS_B                  0x400e81BC 0x400e8400 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_02_LPSPI4_SOUT                    0x400e81BC 0x400e8400 0x400e8618 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_02_GPIO_MUX4_IO11                 0x400e81BC 0x400e8400 0          0x5 0

#define IMXRT_PAD_GPIO_SD_B2_03_GPIO10_IO12                    0x400e81C0 0x400e8404 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_03_USDHC2_DATA0                   0x400e81C0 0x400e8404 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_03_FLEXSPI1_B_DATA00              0x400e81C0 0x400e8404 0x400e8564 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_03_ENET_1G_RX_DATA01              0x400e81C0 0x400e8404 0x400e84D4 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_03_LPUART9_RTS_B                  0x400e81C0 0x400e8404 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_03_LPSPI4_SIN                     0x400e81C0 0x400e8404 0x400e8614 0x4 0
#define IMXRT_PAD_GPIO_SD_B2_03_GPIO_MUX4_IO12                 0x400e81C0 0x400e8404 0          0x5 0

#define IMXRT_PAD_GPIO_SD_B2_04_USDHC2_CLK                     0x400e81C4 0x400e8408 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_04_FLEXSPI1_B_SCLK                0x400e81C4 0x400e8408 0x400e8578 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_04_ENET_1G_RX_DATA02              0x400e81C4 0x400e8408 0x400e84D8 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_04_FLEXSPI1_A_SS1_B               0x400e81C4 0x400e8408 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_04_LPSPI4_PCS1                    0x400e81C4 0x400e8408 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_04_GPIO_MUX4_IO13                 0x400e81C4 0x400e8408 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_04_GPIO10_IO13                    0x400e81C4 0x400e8408 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B2_05_GPIO10_IO14                    0x400e81C8 0x400e840C 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_05_USDHC2_CMD                     0x400e81C8 0x400e840C 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_05_FLEXSPI1_A_DQS                 0x400e81C8 0x400e840C 0x400e8550 0x1 2
#define IMXRT_PAD_GPIO_SD_B2_05_ENET_1G_RX_DATA03              0x400e81C8 0x400e840C 0x400e84DC 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_05_FLEXSPI1_B_SS0_B               0x400e81C8 0x400e840C 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_05_LPSPI4_PCS2                    0x400e81C8 0x400e840C 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_05_GPIO_MUX4_IO14                 0x400e81C8 0x400e840C 0          0x5 0

