RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_SD_B2_06_GPIO10_IO15                    0x400e81CC 0x400e8410 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_06_USDHC2_RESET_B                 0x400e81CC 0x400e8410 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B               0x400e81CC 0x400e8410 0          0x1 0
#define IMXRT_PAD_GPIO_SD_B2_06_ENET_1G_TX_DATA03              0x400e81CC 0x400e8410 0          0x2 0
#define IMXRT_PAD_GPIO_SD_B2_06_LPSPI4_PCS3                    0x400e81CC 0x400e8410 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_06_GPT6_CAPTURE1                  0x400e81CC 0x400e8410 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_06_GPIO_MUX4_IO15                 0x400e81CC 0x400e8410 0          0x5 0

#define IMXRT_PAD_GPIO_SD_B2_07_USDHC2_STROBE                  0x400e81D0 0x400e8414 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_07_FLEXSPI1_A_SCLK                0x400e81D0 0x400e8414 0x400e8574 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_07_ENET_1G_TX_DATA02              0x400e81D0 0x400e8414 0          0x2 0
#define IMXRT_PAD_GPIO_SD_B2_07_LPUART3_CTS_B                  0x400e81D0 0x400e8414 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_07_GPT6_CAPTURE2                  0x400e81D0 0x400e8414 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_07_GPIO_MUX4_IO16                 0x400e81D0 0x400e8414 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_07_LPSPI2_SCK                     0x400e81D0 0x400e8414 0x400e85E4 0x6 1
#define IMXRT_PAD_GPIO_SD_B2_07_ENET_TX_ER                     0x400e81D0 0x400e8414 0          0x8 0
#define IMXRT_PAD_GPIO_SD_B2_07_ENET_QOS_REF_CLK               0x400e81D0 0x400e8414 0x400e84A0 0x9 1
#define IMXRT_PAD_GPIO_SD_B2_07_GPIO10_IO16                    0x400e81D0 0x400e8414 0          0xA 0

#define IMXRT_PAD_GPIO_SD_B2_08_GPIO10_IO17                    0x400e81D4 0x400e8418 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_08_USDHC2_DATA4                   0x400e81D4 0x400e8418 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_08_FLEXSPI1_A_DATA00              0x400e81D4 0x400e8418 0x400e8554 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_08_ENET_1G_TX_DATA01              0x400e81D4 0x400e8418 0          0x2 0
#define IMXRT_PAD_GPIO_SD_B2_08_LPUART3_RTS_B                  0x400e81D4 0x400e8418 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_08_GPT6_COMPARE1                  0x400e81D4 0x400e8418 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_08_GPIO_MUX4_IO17                 0x400e81D4 0x400e8418 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_08_LPSPI2_PCS0                    0x400e81D4 0x400e8418 0x400e85DC 0x6 1

#define IMXRT_PAD_GPIO_SD_B2_09_GPIO10_IO18                    0x400e81D8 0x400e841C 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_09_USDHC2_DATA5                   0x400e81D8 0x400e841C 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_09_FLEXSPI1_A_DATA01              0x400e81D8 0x400e841C 0x400e8558 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_09_ENET_1G_TX_DATA00              0x400e81D8 0x400e841C 0          0x2 0
#define IMXRT_PAD_GPIO_SD_B2_09_LPUART5_CTS_B                  0x400e81D8 0x400e841C 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_09_GPT6_COMPARE2                  0x400e81D8 0x400e841C 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_09_GPIO_MUX4_IO18                 0x400e81D8 0x400e841C 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_09_LPSPI2_SOUT                    0x400e81D8 0x400e841C 0x400e85EC 0x6 1

#define IMXRT_PAD_GPIO_SD_B2_10_GPIO10_IO19                    0x400e81DC 0x400e8420 0          0xA 0
#define IMXRT_PAD_GPIO_SD_B2_10_USDHC2_DATA6                   0x400e81DC 0x400e8420 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_10_FLEXSPI1_A_DATA02              0x400e81DC 0x400e8420 0x400e855C 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_10_ENET_1G_TX_EN                  0x400e81DC 0x400e8420 0          0x2 0
#define IMXRT_PAD_GPIO_SD_B2_10_LPUART5_RTS_B                  0x400e81DC 0x400e8420 0          0x3 0
#define IMXRT_PAD_GPIO_SD_B2_10_GPT6_COMPARE3                  0x400e81DC 0x400e8420 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_10_GPIO_MUX4_IO19                 0x400e81DC 0x400e8420 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_10_LPSPI2_SIN                     0x400e81DC 0x400e8420 0x400e85E8 0x6 1

#define IMXRT_PAD_GPIO_SD_B2_11_USDHC2_DATA7                   0x400e81E0 0x400e8424 0          0x0 0
#define IMXRT_PAD_GPIO_SD_B2_11_FLEXSPI1_A_DATA03              0x400e81E0 0x400e8424 0x400e8560 0x1 1
#define IMXRT_PAD_GPIO_SD_B2_11_ENET_1G_TX_CLK_IO              0x400e81E0 0x400e8424 0x400e84E8 0x2 1
#define IMXRT_PAD_GPIO_SD_B2_11_ENET_1G_REF_CLK                0x400e81E0 0x400e8424 0x400e84C4 0x3 1
#define IMXRT_PAD_GPIO_SD_B2_11_GPT6_CLK                       0x400e81E0 0x400e8424 0          0x4 0
#define IMXRT_PAD_GPIO_SD_B2_11_GPIO_MUX4_IO20                 0x400e81E0 0x400e8424 0          0x5 0
#define IMXRT_PAD_GPIO_SD_B2_11_LPSPI2_PCS1                    0x400e81E0 0x400e8424 0x400e85E0 0x6 1
#define IMXRT_PAD_GPIO_SD_B2_11_GPIO10_IO20                    0x400e81E0 0x400e8424 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK          0x400e81E4 0x400e8428 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_00_ENET_1G_RX_EN                0x400e81E4 0x400e8428 0x400e84E0 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_00_TMR1_TIMER0                  0x400e81E4 0x400e8428 0x400e863C 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_00_XBAR1_INOUT26                0x400e81E4 0x400e8428 0x400e86F0 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_00_GPIO_MUX4_IO21               0x400e81E4 0x400e8428 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_00_ENET_QOS_RX_EN               0x400e81E4 0x400e8428 0x400e84F8 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_00_GPIO10_IO21                  0x400e81E4 0x400e8428 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE       0x400e81E8 0x400e842C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_1G_RX_CLK               0x400e81E8 0x400e842C 0x400e84CC 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_1G_RX_ER                0x400e81E8 0x400e842C 0x400e84E4 0x2 1
#define IMXRT_PAD_GPIO_DISP_B1_01_TMR1_TIMER1                  0x400e81E8 0x400e842C 0x400e8640 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_01_XBAR1_INOUT27                0x400e81E8 0x400e842C 0x400e86F4 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_01_GPIO_MUX4_IO22               0x400e81E8 0x400e842C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_QOS_RX_CLK              0x400e81E8 0x400e842C 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_01_ENET_QOS_RX_ER               0x400e81E8 0x400e842C 0x400e84FC 0x9 0
#define IMXRT_PAD_GPIO_DISP_B1_01_GPIO10_IO22                  0x400e81E8 0x400e842C 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_02_GPIO10_IO23                  0x400e81EC 0x400e8430 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC        0x400e81EC 0x400e8430 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_02_ENET_1G_RX_DATA00            0x400e81EC 0x400e8430 0x400e84D0 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_02_LPI2C3_SCL                   0x400e81EC 0x400e8430 0x400e85BC 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_02_TMR1_TIMER2                  0x400e81EC 0x400e8430 0x400e8644 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_02_XBAR1_INOUT28                0x400e81EC 0x400e8430 0x400e86F8 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_02_GPIO_MUX4_IO23               0x400e81EC 0x400e8430 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_02_ENET_QOS_RX_DATA00           0x400e81EC 0x400e8430 0x400e84F0 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_02_LPUART1_TXD                  0x400e81EC 0x400e8430 0x400e8620 0x9 1

#define IMXRT_PAD_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC        0x400e81F0 0x400e8434 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_03_ENET_1G_RX_DATA01            0x400e81F0 0x400e8434 0x400e84D4 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_03_LPI2C3_SDA                   0x400e81F0 0x400e8434 0x400e85C0 0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_03_TMR2_TIMER0                  0x400e81F0 0x400e8434 0x400e8648 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_03_XBAR1_INOUT29                0x400e81F0 0x400e8434 0x400e86FC 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_03_GPIO_MUX4_IO24               0x400e81F0 0x400e8434 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_03_ENET_QOS_RX_DATA01           0x400e81F0 0x400e8434 0x400e84F4 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_03_LPUART1_RXD                  0x400e81F0 0x400e8434 0x400e861C 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_03_GPIO10_IO24                  0x400e81F0 0x400e8434 0          0xA 0

