RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00       0x400e81F4 0x400e8438 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_04_ENET_1G_RX_DATA02            0x400e81F4 0x400e8438 0x400e84D8 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_04_LPUART4_RXD                  0x400e81F4 0x400e8438 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_04_TMR2_TIMER1                  0x400e81F4 0x400e8438 0x400e864C 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_04_XBAR1_INOUT30                0x400e81F4 0x400e8438 0x400e8700 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_04_GPIO_MUX4_IO25               0x400e81F4 0x400e8438 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_04_ENET_QOS_RX_DATA02           0x400e81F4 0x400e8438 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_04_LPSPI3_SCK                   0x400e81F4 0x400e8438 0x400e8600 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_04_GPIO10_IO25                  0x400e81F4 0x400e8438 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_05_GPIO10_IO26                  0x400e81F8 0x400e843C 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01       0x400e81F8 0x400e843C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_05_ENET_1G_RX_DATA03            0x400e81F8 0x400e843C 0x400e84DC 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_05_LPUART4_CTS_B                0x400e81F8 0x400e843C 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_05_TMR2_TIMER2                  0x400e81F8 0x400e843C 0x400e8650 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_05_XBAR1_INOUT31                0x400e81F8 0x400e843C 0x400e8704 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_05_GPIO_MUX4_IO26               0x400e81F8 0x400e843C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_05_ENET_QOS_RX_DATA03           0x400e81F8 0x400e843C 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_05_LPSPI3_SIN                   0x400e81F8 0x400e843C 0x400e8604 0x9 1

#define IMXRT_PAD_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02       0x400e81FC 0x400e8440 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_06_ENET_1G_TX_DATA03            0x400e81FC 0x400e8440 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_06_LPUART4_TXD                  0x400e81FC 0x400e8440 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_06_TMR3_TIMER0                  0x400e81FC 0x400e8440 0x400e8654 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_06_XBAR1_INOUT32                0x400e81FC 0x400e8440 0x400e8708 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_06_GPIO_MUX4_IO27               0x400e81FC 0x400e8440 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_06_SRC_BT_CFG00                 0x400e81FC 0x400e8440 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_06_ENET_QOS_TX_DATA03           0x400e81FC 0x400e8440 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_06_LPSPI3_SOUT                  0x400e81FC 0x400e8440 0x400e8608 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_06_GPIO10_IO27                  0x400e81FC 0x400e8440 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03       0x400e8200 0x400e8444 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_07_ENET_1G_TX_DATA02            0x400e8200 0x400e8444 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_07_LPUART4_RTS_B                0x400e8200 0x400e8444 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_07_TMR3_TIMER1                  0x400e8200 0x400e8444 0x400e8658 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_07_XBAR1_INOUT33                0x400e8200 0x400e8444 0x400e870C 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_07_GPIO_MUX4_IO28               0x400e8200 0x400e8444 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_07_SRC_BT_CFG01                 0x400e8200 0x400e8444 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_07_ENET_QOS_TX_DATA02           0x400e8200 0x400e8444 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_07_LPSPI3_PCS0                  0x400e8200 0x400e8444 0x400e85F0 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_07_GPIO10_IO28                  0x400e8200 0x400e8444 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_08_GPIO10_IO29                  0x400e8204 0x400e8448 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04       0x400e8204 0x400e8448 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_08_ENET_1G_TX_DATA01            0x400e8204 0x400e8448 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_08_USDHC1_CD_B                  0x400e8204 0x400e8448 0x400e86C8 0x2 1
#define IMXRT_PAD_GPIO_DISP_B1_08_TMR3_TIMER2                  0x400e8204 0x400e8448 0x400e865C 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_08_XBAR1_INOUT34                0x400e8204 0x400e8448 0x400e8710 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_08_GPIO_MUX4_IO29               0x400e8204 0x400e8448 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_08_SRC_BT_CFG02                 0x400e8204 0x400e8448 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_08_ENET_QOS_TX_DATA01           0x400e8204 0x400e8448 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_08_LPSPI3_PCS1                  0x400e8204 0x400e8448 0x400e85F4 0x9 1

#define IMXRT_PAD_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05       0x400e8208 0x400e844C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_09_ENET_1G_TX_DATA00            0x400e8208 0x400e844C 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_09_USDHC1_WP                    0x400e8208 0x400e844C 0x400e86CC 0x2 1
#define IMXRT_PAD_GPIO_DISP_B1_09_TMR4_TIMER0                  0x400e8208 0x400e844C 0x400e8660 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_09_XBAR1_INOUT35                0x400e8208 0x400e844C 0x400e8714 0x4 1
#define IMXRT_PAD_GPIO_DISP_B1_09_GPIO_MUX4_IO30               0x400e8208 0x400e844C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_09_SRC_BT_CFG03                 0x400e8208 0x400e844C 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_09_ENET_QOS_TX_DATA00           0x400e8208 0x400e844C 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_09_LPSPI3_PCS2                  0x400e8208 0x400e844C 0x400e85F8 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_09_GPIO10_IO30                  0x400e8208 0x400e844C 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06       0x400e820C 0x400e8450 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_10_ENET_1G_TX_EN                0x400e820C 0x400e8450 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B1_10_USDHC1_RESET_B               0x400e820C 0x400e8450 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B1_10_TMR4_TIMER1                  0x400e820C 0x400e8450 0x400e8664 0x3 2
#define IMXRT_PAD_GPIO_DISP_B1_10_XBAR1_INOUT36                0x400e820C 0x400e8450 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B1_10_GPIO_MUX4_IO31               0x400e820C 0x400e8450 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_10_SRC_BT_CFG04                 0x400e820C 0x400e8450 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_10_ENET_QOS_TX_EN               0x400e820C 0x400e8450 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_10_LPSPI3_PCS3                  0x400e820C 0x400e8450 0x400e85FC 0x9 1
#define IMXRT_PAD_GPIO_DISP_B1_10_GPIO10_IO31                  0x400e820C 0x400e8450 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07       0x400e8210 0x400e8454 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_1G_TX_CLK_IO            0x400e8210 0x400e8454 0x400e84E8 0x1 2
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_1G_REF_CLK              0x400e8210 0x400e8454 0x400e84C4 0x2 2
#define IMXRT_PAD_GPIO_DISP_B1_11_TMR4_TIMER2                  0x400e8210 0x400e8454 0x400e8668 0x3 1
#define IMXRT_PAD_GPIO_DISP_B1_11_XBAR1_INOUT37                0x400e8210 0x400e8454 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B1_11_GPIO_MUX5_IO00               0x400e8210 0x400e8454 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B1_11_SRC_BT_CFG05                 0x400e8210 0x400e8454 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_QOS_TX_CLK              0x400e8210 0x400e8454 0x400e84A4 0x8 0
#define IMXRT_PAD_GPIO_DISP_B1_11_ENET_QOS_REF_CLK             0x400e8210 0x400e8454 0x400e84A0 0x9 2
#define IMXRT_PAD_GPIO_DISP_B1_11_GPIO11_IO00                  0x400e8210 0x400e8454 0          0xA 0

