RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_DISP_B2_00_GPIO11_IO01                  0x400e8214 0x400e8458 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08       0x400e8214 0x400e8458 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_00_WDOG1_B                      0x400e8214 0x400e8458 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_00_MQS_RIGHT                    0x400e8214 0x400e8458 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_00_ENET_1G_TX_ER                0x400e8214 0x400e8458 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_00_SAI1_TX_DATA03               0x400e8214 0x400e8458 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_00_GPIO_MUX5_IO01               0x400e8214 0x400e8458 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_00_SRC_BT_CFG06                 0x400e8214 0x400e8458 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_00_ENET_QOS_TX_ER               0x400e8214 0x400e8458 0          0x8 0

#define IMXRT_PAD_GPIO_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09       0x400e8218 0x400e845C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_01_USDHC1_VSELECT               0x400e8218 0x400e845C 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_01_MQS_LEFT                     0x400e8218 0x400e845C 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_01_WDOG2_B                      0x400e8218 0x400e845C 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_01_SAI1_TX_DATA02               0x400e8218 0x400e845C 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_01_GPIO_MUX5_IO02               0x400e8218 0x400e845C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_01_SRC_BT_CFG07                 0x400e8218 0x400e845C 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_01_EWM_OUT_B                    0x400e8218 0x400e845C 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_01_CCM_ENET_REF_CLK_25M         0x400e8218 0x400e845C 0          0x9 0
#define IMXRT_PAD_GPIO_DISP_B2_01_GPIO11_IO02                  0x400e8218 0x400e845C 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_02_GPIO11_IO03                  0x400e821C 0x400e8460 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10       0x400e821C 0x400e8460 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_02_ENET_TX_DATA00               0x400e821C 0x400e8460 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_02_PIT1_TRIGGER3                0x400e821C 0x400e8460 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_02_ARM_TRACE00                  0x400e821C 0x400e8460 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_02_SAI1_TX_DATA01               0x400e821C 0x400e8460 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_02_GPIO_MUX5_IO03               0x400e821C 0x400e8460 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_02_SRC_BT_CFG08                 0x400e821C 0x400e8460 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_02_ENET_QOS_TX_DATA00           0x400e821C 0x400e8460 0          0x8 0

#define IMXRT_PAD_GPIO_DISP_B2_03_GPIO11_IO04                  0x400e8220 0x400e8464 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_03_VIDEO_MUX_LCDIF_DATA11       0x400e8220 0x400e8464 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_03_ENET_TX_DATA01               0x400e8220 0x400e8464 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_03_PIT1_TRIGGER2                0x400e8220 0x400e8464 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_03_ARM_TRACE01                  0x400e8220 0x400e8464 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_03_SAI1_MCLK                    0x400e8220 0x400e8464 0x400e866C 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_03_GPIO_MUX5_IO04               0x400e8220 0x400e8464 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_03_SRC_BT_CFG09                 0x400e8220 0x400e8464 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_03_ENET_QOS_TX_DATA01           0x400e8220 0x400e8464 0          0x8 0

#define IMXRT_PAD_GPIO_DISP_B2_04_VIDEO_MUX_LCDIF_DATA12       0x400e8224 0x400e8468 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_04_ENET_TX_EN                   0x400e8224 0x400e8468 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_04_PIT1_TRIGGER1                0x400e8224 0x400e8468 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_04_ARM_TRACE02                  0x400e8224 0x400e8468 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_04_SAI1_RX_SYNC                 0x400e8224 0x400e8468 0x400e8678 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_04_GPIO_MUX5_IO05               0x400e8224 0x400e8468 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_04_SRC_BT_CFG10                 0x400e8224 0x400e8468 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_04_ENET_QOS_TX_EN               0x400e8224 0x400e8468 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_04_GPIO11_IO05                  0x400e8224 0x400e8468 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_05_GPIO11_IO06                  0x400e8228 0x400e846C 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_05_VIDEO_MUX_LCDIF_DATA13       0x400e8228 0x400e846C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_05_ENET_TX_CLK                  0x400e8228 0x400e846C 0x400e84C0 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_05_ENET_REF_CLK                 0x400e8228 0x400e846C 0x400e84A8 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_05_ARM_TRACE03                  0x400e8228 0x400e846C 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_05_SAI1_RX_BCLK                 0x400e8228 0x400e846C 0x400e8670 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_05_GPIO_MUX5_IO06               0x400e8228 0x400e846C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_05_SRC_BT_CFG11                 0x400e8228 0x400e846C 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_05_ENET_QOS_TX_CLK              0x400e8228 0x400e846C 0x400e84A4 0x8 1

#define IMXRT_PAD_GPIO_DISP_B2_06_GPIO11_IO07                  0x400e822C 0x400e8470 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_06_VIDEO_MUX_LCDIF_DATA14       0x400e822C 0x400e8470 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_06_ENET_RX_DATA00               0x400e822C 0x400e8470 0x400e84B0 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_06_LPUART7_TXD                  0x400e822C 0x400e8470 0x400e8630 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_06_ARM_TRACE_CLK                0x400e822C 0x400e8470 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_06_SAI1_RX_DATA00               0x400e822C 0x400e8470 0x400e8674 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_06_GPIO_MUX5_IO07               0x400e822C 0x400e8470 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_06_ENET_QOS_RX_DATA00           0x400e822C 0x400e8470 0x400e84F0 0x8 1

#define IMXRT_PAD_GPIO_DISP_B2_07_VIDEO_MUX_LCDIF_DATA15       0x400e8230 0x400e8474 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_07_ENET_RX_DATA01               0x400e8230 0x400e8474 0x400e84B4 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_07_LPUART7_RXD                  0x400e8230 0x400e8474 0x400e862C 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_07_ARM_TRACE_SWO                0x400e8230 0x400e8474 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_07_SAI1_TX_DATA00               0x400e8230 0x400e8474 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_07_GPIO_MUX5_IO08               0x400e8230 0x400e8474 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_07_ENET_QOS_RX_DATA01           0x400e8230 0x400e8474 0x400e84F4 0x8 1
#define IMXRT_PAD_GPIO_DISP_B2_07_GPIO11_IO08                  0x400e8230 0x400e8474 0          0xA 0

