RTEMS/rtems/bsps/arm/imxrt/include/imxrt/imxrt1166-pinfunc.h
#define IMXRT_PAD_GPIO_DISP_B2_08_GPIO11_IO09                  0x400e8234 0x400e8478 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_08_VIDEO_MUX_LCDIF_DATA16       0x400e8234 0x400e8478 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_08_ENET_RX_EN                   0x400e8234 0x400e8478 0x400e84B8 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_08_LPUART8_TXD                  0x400e8234 0x400e8478 0x400e8638 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_08_ARM_CM7_EVENTO               0x400e8234 0x400e8478 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_08_SAI1_TX_BCLK                 0x400e8234 0x400e8478 0x400e867C 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_08_GPIO_MUX5_IO09               0x400e8234 0x400e8478 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_08_ENET_QOS_RX_EN               0x400e8234 0x400e8478 0x400e84F8 0x8 1
#define IMXRT_PAD_GPIO_DISP_B2_08_LPUART1_TXD                  0x400e8234 0x400e8478 0x400e8620 0x9 2

#define IMXRT_PAD_GPIO_DISP_B2_09_GPIO11_IO10                  0x400e8238 0x400e847C 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_09_VIDEO_MUX_LCDIF_DATA17       0x400e8238 0x400e847C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_09_ENET_RX_ER                   0x400e8238 0x400e847C 0x400e84BC 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_09_LPUART8_RXD                  0x400e8238 0x400e847C 0x400e8634 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_09_ARM_CM7_EVENTI               0x400e8238 0x400e847C 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_09_SAI1_TX_SYNC                 0x400e8238 0x400e847C 0x400e8680 0x4 1
#define IMXRT_PAD_GPIO_DISP_B2_09_GPIO_MUX5_IO10               0x400e8238 0x400e847C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_09_ENET_QOS_RX_ER               0x400e8238 0x400e847C 0x400e84FC 0x8 1
#define IMXRT_PAD_GPIO_DISP_B2_09_LPUART1_RXD                  0x400e8238 0x400e847C 0x400e861C 0x9 2

#define IMXRT_PAD_GPIO_DISP_B2_10_GPIO11_IO11                  0x400e823C 0x400e8480 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_10_VIDEO_MUX_LCDIF_DATA18       0x400e823C 0x400e8480 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_10_EMVSIM2_IO                   0x400e823C 0x400e8480 0x400e86A8 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_10_LPUART2_TXD                  0x400e823C 0x400e8480 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_10_WDOG2_RESET_B_DEB            0x400e823C 0x400e8480 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_10_XBAR1_INOUT38                0x400e823C 0x400e8480 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_10_GPIO_MUX5_IO11               0x400e823C 0x400e8480 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_10_LPI2C3_SCL                   0x400e823C 0x400e8480 0x400e85BC 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_10_ENET_QOS_RX_ER               0x400e823C 0x400e8480 0x400e84FC 0x8 2
#define IMXRT_PAD_GPIO_DISP_B2_10_SPDIF_IN                     0x400e823C 0x400e8480 0x400e86B4 0x9 2

#define IMXRT_PAD_GPIO_DISP_B2_11_VIDEO_MUX_LCDIF_DATA19       0x400e8240 0x400e8484 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_11_EMVSIM2_CLK                  0x400e8240 0x400e8484 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_11_LPUART2_RXD                  0x400e8240 0x400e8484 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_11_WDOG1_RESET_B_DEB            0x400e8240 0x400e8484 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_11_XBAR1_INOUT39                0x400e8240 0x400e8484 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_11_GPIO_MUX5_IO12               0x400e8240 0x400e8484 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_11_LPI2C3_SDA                   0x400e8240 0x400e8484 0x400e85C0 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_11_ENET_QOS_CRS                 0x400e8240 0x400e8484 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_11_SPDIF_OUT                    0x400e8240 0x400e8484 0          0x9 0
#define IMXRT_PAD_GPIO_DISP_B2_11_GPIO11_IO12                  0x400e8240 0x400e8484 0          0xA 0

#define IMXRT_PAD_GPIO_DISP_B2_12_GPIO11_IO13                  0x400e8244 0x400e8488 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_12_VIDEO_MUX_LCDIF_DATA20       0x400e8244 0x400e8488 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_12_EMVSIM2_RST                  0x400e8244 0x400e8488 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_12_FLEXCAN1_TX                  0x400e8244 0x400e8488 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_12_LPUART2_CTS_B                0x400e8244 0x400e8488 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_12_XBAR1_INOUT40                0x400e8244 0x400e8488 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_12_GPIO_MUX5_IO13               0x400e8244 0x400e8488 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_12_LPI2C4_SCL                   0x400e8244 0x400e8488 0x400e85C4 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_12_ENET_QOS_COL                 0x400e8244 0x400e8488 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_12_LPSPI4_SCK                   0x400e8244 0x400e8488 0x400e8610 0x9 1

#define IMXRT_PAD_GPIO_DISP_B2_13_GPIO11_IO14                  0x400e8248 0x400e848C 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_13_VIDEO_MUX_LCDIF_DATA21       0x400e8248 0x400e848C 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_13_EMVSIM2_SVEN                 0x400e8248 0x400e848C 0          0x1 0
#define IMXRT_PAD_GPIO_DISP_B2_13_FLEXCAN1_RX                  0x400e8248 0x400e848C 0x400e8498 0x2 1
#define IMXRT_PAD_GPIO_DISP_B2_13_LPUART2_RTS_B                0x400e8248 0x400e848C 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_13_ENET_REF_CLK                 0x400e8248 0x400e848C 0x400e84A8 0x4 2
#define IMXRT_PAD_GPIO_DISP_B2_13_GPIO_MUX5_IO14               0x400e8248 0x400e848C 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_13_LPI2C4_SDA                   0x400e8248 0x400e848C 0x400e85C8 0x6 1
#define IMXRT_PAD_GPIO_DISP_B2_13_ENET_QOS_1588_EVENT0_OUT     0x400e8248 0x400e848C 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_13_LPSPI4_SIN                   0x400e8248 0x400e848C 0x400e8614 0x9 1

#define IMXRT_PAD_GPIO_DISP_B2_14_GPIO_MUX5_IO15               0x400e824C 0x400e8490 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_14_FLEXCAN1_TX                  0x400e824C 0x400e8490 0          0x6 0
#define IMXRT_PAD_GPIO_DISP_B2_14_ENET_QOS_1588_EVENT0_IN      0x400e824C 0x400e8490 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_14_LPSPI4_SOUT                  0x400e824C 0x400e8490 0x400e8618 0x9 1
#define IMXRT_PAD_GPIO_DISP_B2_14_GPIO11_IO15                  0x400e824C 0x400e8490 0          0xA 0
#define IMXRT_PAD_GPIO_DISP_B2_14_VIDEO_MUX_LCDIF_DATA22       0x400e824C 0x400e8490 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_14_EMVSIM2_PD                   0x400e824C 0x400e8490 0x400e86AC 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_14_WDOG2_B                      0x400e824C 0x400e8490 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_14_VIDEO_MUX_EXT_DCIC1          0x400e824C 0x400e8490 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_14_ENET_1G_REF_CLK              0x400e824C 0x400e8490 0x400e84C4 0x4 3

#define IMXRT_PAD_GPIO_DISP_B2_15_VIDEO_MUX_LCDIF_DATA23       0x400e8250 0x400e8494 0          0x0 0
#define IMXRT_PAD_GPIO_DISP_B2_15_EMVSIM2_POWER_FAIL           0x400e8250 0x400e8494 0x400e86B0 0x1 1
#define IMXRT_PAD_GPIO_DISP_B2_15_WDOG1_B                      0x400e8250 0x400e8494 0          0x2 0
#define IMXRT_PAD_GPIO_DISP_B2_15_VIDEO_MUX_EXT_DCIC2          0x400e8250 0x400e8494 0          0x3 0
#define IMXRT_PAD_GPIO_DISP_B2_15_PIT1_TRIGGER0                0x400e8250 0x400e8494 0          0x4 0
#define IMXRT_PAD_GPIO_DISP_B2_15_GPIO_MUX5_IO16               0x400e8250 0x400e8494 0          0x5 0
#define IMXRT_PAD_GPIO_DISP_B2_15_FLEXCAN1_RX                  0x400e8250 0x400e8494 0x400e8498 0x6 2
#define IMXRT_PAD_GPIO_DISP_B2_15_ENET_QOS_1588_EVENT0_AUX_IN  0x400e8250 0x400e8494 0          0x8 0
#define IMXRT_PAD_GPIO_DISP_B2_15_LPSPI4_PCS0                  0x400e8250 0x400e8494 0x400e860C 0x9 1
#define IMXRT_PAD_GPIO_DISP_B2_15_GPIO11_IO16                  0x400e8250 0x400e8494 0          0xA 0

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* LIBBSP_ARM_IMXRT_IMXRT1050_PINFUNC_H */
